# 가설검정
# 카이제곱 검정(적합도, 독립성), t-test, anova
# 상관분석, 회귀분석

# 이번에는 상관분석이다
# regression -> classification  ->  clustering 순으로 학습한다.

# 우리는 두 변수간의 관계를 통해서(하나의 변수가 다른 변수에 영향을 주는 상관관계일 때)
# 1. 얼마나 촘촘한지
# 2. 정비례인지 반비례인지
# 를 구한다. 그때 공분산을 통해서 두 변수간의 관계가 정비례인지 반비례인지 알 수 있다.

# 평균 -> 분산 -> 공분산 -> 상관계수
# 하지만 이런 공분산에도 문제가 있다. 그 문제점을 해결한 것이 '상관계수'이다
# 상관계수 = 공분산을 표준화한것이다.

# 상관분석  ->  선형회귀model을 제작  ->  회귀분석
# 이 순서로 진행한다.
#-----------------------------------------------------------------------------------------------------------------------------------------------

# 분산(Varience) : 한 개의 변수가 평균으로부터 얼마나 흩어져 있는지 확인하는 것
#                  변수가 하나인 경우에는 분산은 거리와 관계가 있다.
# 공분산(Co-Varience) : 두 개의 변수가 함께 어떻게 변하고 있는지 확인하는 것 
#                      두 변수가 각각의 평균을 기준으로 함께 증가하거나 감소하는 경향이 있는지 나타내는 통계량
#                      = 하나의 변수가 증가할 때 다른 변수가 줄어드는지를 혹은 그 반대인지 확인하는 통계량이다.

# 계산 : 각 관측값이 평균보다 높은지 낮은지를 비교하여 두 편차의 곱을 계산한다. = 두 확률변수가 함께 변하는 정도를 나타내는 값
# Cov(X, Y) = E[(X-E(X))(Y-E(Y))]
#           = E (XY) - E(X)E(Y)
# 변수가 2개인 경우에는 분산은 방향까지 가진다.

# 공분산을 표준화한것 = 상관계수
# 우리는 상관계수를 구하기 위해서 공분산을 배운다.
#--------------------------------------------------------------------------------------------------------------------------------------------------

# "공분산"
import numpy as np

# < 공분산이 양수인 경우 > 
print('변수1 : ', np.arange(1, 6))
print('변수2 : ', np.arange(2, 7))
# 변수1 :  [1 2 3 4 5]
# 변수2 :  [2 3 4 5 6]
# 2차원 그래프에서 (1,2), (2,3), (3,4), (4,5), (5,6)
print(np.cov(np.arange(1, 6), np.arange(2, 7)))
# [[2.5 2.5]
#  [2.5 2.5]]
# [[변수1의 분산,     두 변수의 공분산],
#  [두 변수의 공분산,  변수2의 분산    ]]
# 공분산 : 2.5 = 우상향하고 있다. “공분산이 2.5로 양수이므로, 변수1이 커질 때 변수2도 함께 커지는 경향이 있다"


# < 공분산이 음수인 경우 > 
print('변수1 : ', np.arange(1, 6))
print('변수2 : ', np.arange(6, 1, -1))
# 변수1 :  [1 2 3 4 5]
# 변수2 :  [6 5 4 3 2]
# 2차원 그래프에서 (1,6), (2,5), (3,4), (4,3), (5,2)
print(np.cov(np.arange(1, 6), np.arange(6, 1, -1)))
# [[ 2.5 -2.5]
#  [-2.5  2.5]]
# [[변수1의 분산,     두 변수의 공분산],
#  [두 변수의 공분산,  변수2의 분산    ]]
# 공분산 : -2.5 = 변수1이 커질 때 변수2는 작아지는 경향이 있다(우하향).


# < 공분산이 '0'인 경우 > 
print('변수1 : ', np.arange(1, 6))
print('변수2 : ', np.array([4, 1, 0, 1, 4]))
# 변수1 :  [1 2 3 4 5]
# 변수2 :  [4 1 0 1 4]
# 2차원 그래프에서 (1,4), (2,1), (3,0), (4,1), (5,4)
print(np.cov(np.arange(1, 6), np.array([4, 1, 0, 1, 4])))
# [[2.5 0. ]
#  [0.  3.5]]
# [[변수1의 분산,     두 변수의 공분산],
#  [두 변수의 공분산,  변수2의 분산    ]]
# 공분산 : 0 = 두 변수 사이에 선형적으로 함께 변하는 경향이 없다.
# (관계가 전혀 없다는 뜻은 아니다. 이 예제에는 변수2 = (변수1 - 3)**2 관계가 있다.)


# 공분산을 통해서 해당 그래프가 변수1,2에 대하여 우상향인지 우하향인지 혹은 방향이 없는지 알 수 있다.
# 공분산 : 두 변수의 관계에 대한 방향을 알 수 있다. = 우상향인지 우하향인지는 알 수 있다.
#          하지만 '강도'를 알 수는 없다.
# 그래서 공분산의 수치를 표준화를 시킨다. 그러면 모든 공분산 값이 '-1 ~ 1'사이의 범위로 들어오게 된다.
# = 강도를 알 수 있게 된다.
# = 상관계수
# -------------------------------------------------------------------------------------------------------------------------------

# 상관계수 : 공분산 값을 표준화 한 것 = 공분산을 두 변수의 표준편차곱으로 나눈 값
#                                   = 두 변수의 측정단위나 크기에 상관없이 -1 ~ 1 사이의 값으로 표현 가능하다.
x = [8, 3, 6, 6, 9, 4, 3, 9, 3, 4]
print('x의 평균 : ', np.mean(x))
print('x의 분산 : ', np.var(x))
# 결과 : 
# x의 평균 :  5.5
# x의 분산 :  5.45

y = [6, 2, 4, 6, 9, 5, 1, 8, 4, 5]
print('y의 평균 : ', np.mean(y))
print('y의 분산 : ', np.var(y))
# 결과 : 
# y의 평균 :  5.0
# y의 분산 :  5.4

import matplotlib.pyplot as plt
plt.plot(x, y, 'o')
plt.show()
print()

# 분산을 통해 공분산 구해보기
print('x, y의 공분산 : ', np.cov(x, y))
# [ [ 변수1의 분산var(y),     두 변수의 공분산(cov) ],
#   [ 두 변수의 공분산(cov),  변수2의 분산(var(y))  ] ]
# 결과 :
#  [ [6.05555556 5.22222222 ]
#    [5.22222222 6.         ] ]
# 공분산 값 : 5.222222222

x2 = [80, 30, 60, 60, 90, 40, 30, 90, 30, 40]
y2 = [60, 20, 40, 60, 90, 50, 10, 80, 40, 50]
print('x2, y2의 공분산 : ', np.cov(x2, y2)[0, 1])
# 두 변수들에 대해서 공분산 값만 순수하게 가져옴.
# 공분산 값 : 522.2222222222222

plt.plot(x2, y2, 'o')
plt.show()
# 공분산으로 두 변수는 양의 관계로 우상향한다 까지만 알 수 있다. 데이터가 우상향 방향으로 퍼져있는지 혹은 몰려있는지(밀도)를 알려주지는 않는다. = 강도를 알 수 없다.
print()

# 공분산의 문제점(한계) :  패턴이 일치하더라도 두 데이터의 단위에 따라 공분산의 크기가 달라지므로 절대적 크기 판단이 어렵다. 
# 그래서 공분산을 표준화하여 "-1(음) ~ 0 ~ 1(양)"의 범위로 만든 것이 "상관계수(r)"이다.

print("x, y의 상관계수 : ", np.corrcoef(x,y))
print("x, y의 상관계수 : ", np.corrcoef(x,y)[0,1])
print("x2, y2의 상관계수 : ", np.corrcoef(x2,y2)[0,1])
# x, y의 상관계수 :  0.8663686463212855
# x2, y2의 상관계수 :  0.8663686463212852
# 두 데이터의 크기는 달라 공분산을 사용하면 두 데이터의 값이 달랐지만,
# 상관계수로 보니 두 데이터 값이 동일하다.
# = 데이터의 단위나 크기가 달라도, 두 변수가 함께 움직이는 관계의 강도를 비교할 수 있다.
# 1에 가까울수록 상관관계가 강하다 = 더 밀집되어 있다.

# 1. 피어슨 상관계수(관계) : 범위에 따라서 해석하는 기준을 만들었다.
# 상관계수 크기에 따른 해석 기준
# - 0.7 ~ 1.0 : 매우 강한 상관관계
# - 0.3 ~ 0.7 : 중간 정도의 상관관계
# - 0.0 ~ 0.3 : 약한 상관관계 혹은 무관함
# - 음수 : 우하향하는 관계이다.
# 2. 스피어만 상관계수(관계)
# 3. 켄달 상관계수(관계)
# 우리는 이중 피어슨 상관계수만 사용한다.

# 그리고 이 상관관계를 가지고 "모델"을 만든다.
# 하지만 상관관계가 있다고 해서 인과관계가 있는 것은 아닐 수도 있기에 반드시 상관관계가 있다고 모델제작을 확정짓지말자 

# 실제로는 0.3정도를 기준으로 두 변수 간의 관계가 상관이 있다고 보고 선형회귀모델을 만든다!!
# "선형회귀모델" : 두 변수의 인과관계를 확인하는 모델
# 이때 선형회귀모델은 상관분석을 통해 두 변수가 인과관계가 있는지 파악한다.

from scipy import stats
print("scipy 모듈을 사용 r : ", stats.pearsonr(x, y))
# 결과 : PearsonRResult(statistic = np.float64(0.8663686463212853), 
#                          pvalue = np.float64(0.0011836205396685649))
print("scipy 모듈을 사용2 r : ", stats.spearmanr(x, y))
# 결과 : SignificanceResult(statistic = np.float64(0.9000703207408192), 
#                              pvalue = np.float64(0.0003861022071216138))
# 이렇게 피어슨 상관계수가 아닌 스피어만을 사용할 수도 있다.

print('----- 비선형 데이터인 경우 공분산과 상관계수는 의미가 없다 -----')
m = [-3, -2, -1, 0, 1, 2, 3]
n = [9, 4, 1, 0, 1, 4, 9]
plt.plot(m, n, 'o')
plt.show()
# 밥그릇 처럼 생긴 위와 같은 데이터는 비선형이다.
# 반드시 '선형'인 데이터만 공분산과 상관계수가 의미 있다!!!

print(np.cov(m, n)[0, 1])
print(np.corrcoef(m, n)[0, 1])
# 결과 : 0.0
# 결과 : 0.0
# 비선형이기 때문에 항상 0이 나온다.

# 우리가 뒤에서 사용할 regression / classification / clusering의 추세선은 모두 직선이다. 
# 일차방정식(y = wx + b)이기 때문 weight와 bias만 사용