# 최소 제곱 문제를 "행렬방정식"으로 표현하고, 수치 선형대수 연산을 통해 최적의 "회귀계수(w, b)" 구하기

import numpy as np
import matplotlib.pyplot as plt
import koreanize_matplotlib

x = np.array([0, 1, 2, 3])
y = np.array([-1,0.2, 0.5, 2.1])
# (0, -1), (1, 0.2), (2, 0.5), (3, 2.1)

plt.scatter(x, y)
plt.grid(True)
plt.show()
# x와 y의 관계를 '산점도'로 나타냄
# 이를 상관관계로 나타내면 굉장히 강한 상관성을 드러낸다고 할 수 있다.
# = x가 커질때 y도 커지는 구조이기때문이다.

# 우리는 저 4개의 점의 평균을 관통하는 추세선을 만들어야 한다.
# 그리고 그 추세선을 기준으로 임의의 x값에서의 y값을 유추할 수 있다.
# 즉, 경험하지 못한 독립변수에 대한 종속변수의 값을 얻을 수 있다.

# 정량적 분석 : 회귀분석 ... 우리가 하고 있는 것
# 정성적 분석 : classiication

# 주어진 데이터를 내가 행렬곱으로 할 수 있도록 재배치
A = np.vstack([x, np.ones(len(x))]).T
print(A)
# 결과 : 
#       [ [0. 1.]
#         [1. 1.]
#         [2. 1.]
#         [3. 1.] ]

# 첫번째 열은 기울기'w'를
# 두번째 열은 절편'b'를 적용하기 위한것
# [0, 1] → 0*w + 1*b
# [1, 1] → 1*w + 1*b
# [2, 1] → 2*w + 1*b
# [3, 1] → 3*w + 1*b

# y = wx+b의 w, b구하기
import numpy.linalg as lin 
weight, bias = lin.lstsq(A, y)[0] # "최소제곱법(lstsq)" 연산!!
print(weight, ' ', bias)
# 결과 : 0.96   -0.9899999999999998

# 회귀식 형태 ->  y = wx+b
# 회귀식 : 예측y = 0.96 * x - 0.99
#        -> x가 '1'증가하면 예측값 y는 0.99증가한다.

print(0.96 * 0 + -0.9899999999999998) # 실제 y값 : -1    /  예측값 : -0.9899999999999998
print(0.96 * 1 + -0.9899999999999998) # 실제 y값 : 0.2   /  예측값 : -0.029999999999999805
print(0.96 * 2 + -0.9899999999999998) # 실제 y값 : 0.5   /  예측값 : 0.9300000000000002
print(0.96 * 3 + -0.9899999999999998) # 실제 y값 : 2.1   /  예측값 : 1.8900000000000001
print(0.96 * 7 + -0.9899999999999998) # 실제 y값 : 2.1   /  예측값 : 5.73

# 손실 : 실제값과 예측값의 차이 
# 손실을 모두 더하면 거의 '0'이 나온다.
# 잔차 : 실제값과 예측값의 차이
# , y = 0.96x - 0.99는 모든 실제값을 정확하게 재현하는 식이 아니라, 
# 네 점 전체의 추세를 가장 잘 나타내는 직선

plt.scatter(x, y, marker='o', label='실제t값')
plt.plot(x, weight * x + bias, 'r', label="최적화된 선형직선")
plt.grid(True)
plt.show()

# 경험하지 못한 x값에 대한 예측값 y는?
new_x = 7.5
yhat = weight * new_x + bias 
# -> yhat =  0.96 * 7.5 - 0.9899999999998
print("결과 : ", yhat)
# 결과 : 6.209999   
# 신빙성 있는 추론된 결과로 미래의 의사결정을 위한 참고자료로 활용 가능하다.


print("-----------------------")
# 선형회귀모델 추세식 계산(최소제곱법) 클래스
class MySimpleLinearRegression:
    def __init__(self):
        self.w = None
        self.b = None

    def fit(self, x:np.ndarray, y:np.ndarray):
        x_mean = np.mean(x)
        y_mean = np.mean(y)

        # 최소제곱법 공식 적용
        # 1. 기울기(weight) 구하기
        bunja = np.sum((x - x_mean) * (y - y_mean))
        bunmo = np.sum((x - x_mean)**2)
        self.w = bunja / bunmo 
        # 이것이 weight(기울기)이다.

        # 2. 절편(bias) 구하기
        self.b = y_mean - (self.w * x_mean)
        # 이것이 bias(절편)이다.

    def predict(self, new_x:np.ndarray):
    # 추정된 weight와 bias를 이용하여 새로운 x에 대한 예측y값을 도출한다.    
        return self.w * new_x + self.b


# 실습) 임의의 성인 50명의 키를, 몸무게 데이터를 생성 후 이를 바탕으로 추세선을 만들기.
np.random.seed(42)
# 난수 발생을 고정시킴

# 변수1 : '키'(독립변수)
x_height = np.random.normal(175, 5, 50)
# 키 :  (평균키, 표준펀차, 갯수)
# 결과 :  [177.48357077 174.30867849 178.23844269 182.61514928 173.82923313 173.82931522 182.89606408 178.83717365 172.65262807 177.71280022 172.68291154 172.67135123 176.20981136 165.43359878 166.37541084 172.18856235 169.9358444  176.57123666 170.45987962 167.93848149 182.32824384 173.8711185  175.33764102 167.87625907 172.27808638 175.55461295 169.24503211 176.87849009 171.99680655 173.54153125 171.99146694 184.26139092 174.93251388 169.71144536 179.11272456 168.89578175 176.04431798 165.20164938 168.35906976 175.98430618 178.6923329  175.85684141 174.42175859 173.49448152 167.60739005 171.40077896 172.69680615 180.28561113 176.71809145 166.18479922]
# 변수2 : '몸무게'(종속변수)

y_weight = np.random.normal(70, 10, 50)
# 몸무게 :  (평균 몸무게, 표준펀차, 갯수)
# 결과 : [73.24083969 66.1491772  63.23078  76.11676289 80.30999522 79.31280119 61.60782477 66.90787624 73.31263431 79.75545127 65.20825762 68.14341023 58.93665026 58.03793376 78.12525822 83.56240029 69.27989878 80.03532898 73.61636025 63.54880245 73.61395606 85.38036566 69.64173961 85.64643656 43.80254896 78.21902504 70.87047068 67.0099265  70.91760777 50.12431085 67.80328112 73.57112572 84.77894045 64.81729782 61.91506397 64.98242956 79.15402118 73.2875111  64.70239796 75.13267433 70.97077549 79.68644991 62.97946906 66.72337853 66.07891847 55.36485052 72.96120277 72.61055272 70.05113457 67.65412867]
print(x_height)
print(y_weight)
# 해당 평균키와 평균몸무게로 계산되는 요소들이 50개 무작위로 생성되었다.

# ------- Model 생성 ----------
model = MySimpleLinearRegression()
model.fit(x_height, y_weight)
# 키에 따른 몸무게는 어떻게 변할까..?

print("추정된 w(기울기) : ", model.w)
print("추정된 b(절편) : ", model.b)
# 예측한 y값  =  0.20615129092160211 * 키(x값)  +  34.33374147658758

print()

y_pred = model.predict(x_height)
# 기존 데이터 예측값 확인
# 학습된 회귀계수를 이용하여 새로운 키에 대한 몸무게를 추정하는 역할을 한다.

for i in range(len(x_height)):
    print(f"키 : {x_height[i]:.2f}cm의 실제 몸무게 : {y_weight[i]:.2f}kg, 예측몸무게:{y_pred[i]:.2f}kg")
# 키 : 177.48cm의 실제 몸무게 : 73.24kg, 예측몸무게:35.60
# 키 : 174.31cm의 실제 몸무게 : 66.15kg, 예측몸무게:34.94
# 키 : 178.24cm의 실제 몸무게 : 63.23kg, 예측몸무게:35.75
# 키 : 182.62cm의 실제 몸무게 : 76.12kg, 예측몸무게:36.66
# 키 : 173.83cm의 실제 몸무게 : 80.31kg, 예측몸무게:34.85
# ...
print()


# 새로운 키에 대한 몸무게 예측
new_height = np.array([198])
# 그전에 없었던 데이터인 키:198일 때, 몸무게는 몇kg이 나올까?
new_weight = model.predict(new_height)
print(f"키 {new_height[0]}cm인 경우 몸무게는 대략 {new_weight[0]}kg 일 것이다.")
# 해당 예측값이 0차원 벡터값으로 나오기에 인덱스를 사용해서 해당 값만 쏙 빼왔다.


# 시각화
plt.figure(figsize=(9, 6))
plt.scatter(x_height, y_weight, color='blue', label='실제 데이터')

x_line = np.linspace(x_height.min(), x_height.max(), 100)
y_line = model.predict(x_line)

plt.plot(x_line, y_line, color = 'red', linewidth=2, label='회귀직선(추세선)')
# = 회귀직선 = 추세선을 나타냄

plt.xlabel('키(cm)')
plt.ylabel('몸무게(kg)')
plt.title('키에 따른 몸무게 선형회귀 분석')

plt.legend()
plt.grid(alpha=0.3)
plt.tight_layout()

plt.show()
# 그래프에서 각 점들과 추세선간의 차이를 '잔차'라고 한다. 
# '잔차' 제곱의 합이 최소가 되는 회귀선을 찾아낸 것이다.


# 이제부터 파이썬이 제공하는 선형회귀모델 작성법 3가지를 알아보자.