# 이제부터 파이썬이 제공하는 선형회귀모델 작성법 3가지를 알아보자.

# Machine Learning 책 읽아보기
# Machine Learning : '룰 베이스'가 아닌 '데이터 기반 학습'을 하여 모델을 얻는 것이다.

# 전통적 방법의 선형회귀(기계학습 중 지도학습)
# 각 데이터에 대한 잔차제곱합이 최소가 되는 추세선을 만들고, 
# 이를 통해 독립변수가 종속변수에 얼마나 영향을 주는지 인과관계를 분석한다.

# 독립변수 : 연속형
# 종속변수 : 연속형
# 두 변수는 상관관계 및 인과관계가 있어야 한다.
# 정성적(X), 정량적(O)인 모델을 생성한다.

import statsmodels.api as sm
from sklearn.datasets import make_regression
import numpy as np

np.random.seed(12)
x, y, _ = make_regression(n_samples=50, n_features=1, bias=50, coef=True, noise=50)
print(x)
print(y)
# 결과 :
# [[-1.70073563]
#  [-0.67794537]
#  [ 0.31866529]
#  [ 0.13884618]
#  [ 0.53513589]
# ....

# 결과 : 
# [-102.17214291  -10.65869199   78.51235594   62.42316554   97.88091341
#    46.49178624   53.16885304  -13.87179691   39.71761789  140.59412103
#   250.58509445   50.45874176  -42.11650224   -7.92842064   92.32007968
#   -58.72638684   27.28210847   15.60976235   97.18272498   92.27276227
# ....
#   306.95405132  169.52258382  -87.31812896  107.33165682   19.79389882]

r = np.corrcoef(x.ravel(), y)[0, 1]
# ravel()은 차원 떨어트리기
print(f'상관계수 : {r:.4f}')
# 상관계수 : 0.8896
# = 매우 강한 양의 상관관계를 가진다. = 우상향!


print("----------------------------------------------------------")

print("\n 모델 작성 방법1 : , LinearRegression 사용-모델 생성")
from sklearn.linear_model import LinearRegression
# 우리는 이 모델 덕분에 회귀분석을 직접계산을 하지 않고 호출하여 사용할 수 있다.
model = LinearRegression()
fit_model = model.fit(x, y)
# 해당 함수 속을 까보면 우리가 ex4ols.py에서 만든 클래스와 거의 동일하게 생겼다.
# 내부를 보자. ... fit()함수의 역할!!
# 1) 독립변수(x)와 종속변수(y)를 입력 받음
# 2) 예측값과 실제값 사이의 오차제곱합이 최소가 되도록 계산
# 3) 최적의 회귀계수(기울기, 절편)를 구함
# 4) 계산된 계수를 모델에 저장
# 단순선형회귀 모델에서는 y = wx+b와 같은 단순한 형태의 수식을 가진 모델이 만들어진다.
# 이런 선형회귀방정식이 모든 AI모델의 근간이다.

# **주의/참고** : LinearRegression은 신경망처럼 반복학습을 통해 가중치를 갱신하는 것이 아니고, 최소 제곱법이라는 계산을 통해 작성된 것이다.
# 반복학습이 아니라 계산을 통해 결과를 내는 것이다.
# 그러니까 기울기와 절편을 확인해야한다.
print('기울기(가중치, weight, slope) : ', fit_model.coef_)
print('절편(편향, bias) : ', fit_model.intercept_)
# 기울기(가중치, weight, slope) :  95.13485039
# 절편(편향, bias)              :  56.308777652449876
# yhat = 95.13485039 * x + 56.308777652449876 = 추세선 완성
#                                             = 예측값(y)을 확인가능해졌다

# 예측값을 확인!
# 1. 기존의 값을 넣었을 때의 예측값
y_newpred1 = fit_model.predict(x[[0]])
# 기존데이터 '0번째'의 데이터를 입력값으로 주었다.
# 대부분의 경우 scikiy-learn에서 독립변수는 2차원, 종속변수는 1차원이다.
print('예측값1 : ', y_newpred1)
# 예측값1 :  [-154.25637177]

# 2. 새로운 값을 넣었을 때의 예측값 
y_newpred2 = fit_model.predict(np.array([[0.12345], [0.3], [0.5]]))
print('예측값2 : ', y_newpred2)
# 예측값2 :  [ 68.05317493  84.84923277 103.87620285]
# 경험하지 못한 x값에 대해서도 결과인 y값을 줄 수 있다.
