# 이번에는 웹문서(위키백과)를 읽어서 형태소 분석 및 분류를 해보자.
# 위키백과에서 단어를 검색하고 그 결과를 가져와보자.
# 단어 출현 회수를 DataFrame에 저장한다.

# "외부 웹(위키백과)에서 글자를 가져와서 그 글자를 형태소별로 분석해보자. 그리고 형태소 별로 끊어진 각 단어들의 출현 횟수를 정리하여 DataFrame에 저장해보자."

import requests
from bs4 import BeautifulSoup
import pandas as pd
from konlpy.tag import Okt
# ETRI OPEN API를 쓸 수도 있다. 무료 기준으로 일/5000의 제한이 있지만 konlpy보다 빠르다. 하지만 우리는 조금 느려도 무한정 제공되는 konlpy로 한글을 쪼갠다.
from urllib import parse # 한글 인코딩

okt = Okt()

# [1단계~5단계] : web에서 데이터를 가져오는 방법이다.

# [1단계] : url가져오기

# [url생성방법1] : 그대로 복붙
# url = "https://ko.wikipedia.org/wiki/%EC%9D%B4%EC%88%9C%EC%8B%A0"
# # 알아서 '이순신'이라는 글자가 인코딩이 되어버림

# [url생성방법1] : 한글을 그대로 입력
# para = "이순신"
# url = "https://ko.wikipedia.org/wiki/" + para
# print(url)
# 이렇게 해주면 문자열로 출력된다.
# 이 방식은 url이 인코딩이 되지 않은 상태라서 해당 url이 등장하지 않는다!!
# 결과 : https://ko.wikipedia.org/wiki/ + para
# = 이렇게 쓰면 안된다!!

para = parse.quote('이순신')
# 이제 이순신이라는 데이터가 인코딩이 되었다.
url = "https://ko.wikipedia.org/wiki/"+ para
print(url)
# 그러면 이순신이라는 글자를 인코딩이 된다.
# 결과 : https://ko.wikipedia.org/wiki/%EC%9D%B4%EC%88%9C%EC%8B%A0

# [2단계] : 서버로 요청을 할때 보낼 정보 가져오기
headers = {"User-Agent" : "Mozilla/5.0"}

# [3단계] : 서버로 보낸 요청에 응답을 받을때의 객체(response)생성
response = requests.get(url=url, headers=headers)

if response.status_code == 200:
    page = response.text
    # print(page, type(page)) 
    # # 결과 : <class : str>
    # 가져온 결과를 text로 바꿈

# [4단계] : text로 변환한 가져온 정보를 저장된 객체(page)에 대해서 BeautifulSoup를 사용하여 보다 쉽고 빠르게 태그를 이용하여 정보를 빼낼 수 있다.
    soup = BeautifulSoup(page, 'html.parser')

    wordlist = []

# [5단계] : BeautifulSoup를 사용할 수 있는 객체에 대해서 원하는 Tag(부모-자식-자손)를 뽑아낸다.
    for item in soup.select("#mw-content-text p"):
        # print(item.string)
        if item.string != None:
            wordlist += okt.nouns(item.string)

    print("wordlist : ", wordlist)
    # 결과 : wordlist :  ['그', '활', '무과', '급제', '발신', '또', '말타', '활쏘기', '글씨', '당시', '조산', '만호', '이순신', '북방', '여진족', '약탈', '및', '침략', '예상', '수비','위', '차례', '북', '병사', '이일', '추가', '병력', '요청', '모두', '거절', '이', '패전', '책임', '지게', '북', '병사', '이일', '이순신', '그', '책임', '이순신', '죄', '수금', '백의종군', '원균', '대립', '각기', '정', '파적', '입장', '갈등', '심화', '선조', '실록', '선조', '수정', '실록', '두', '인물', '대한', '입장', '차이', '이', '대한','논의', '당시', '뿐', '임진왜란', '논공', '행상', '자리', '진위', '및', '당부', '대한', '논란', '미국', '영국', '해군', '교과서', '책', '해전', '모든', '것', '휴먼', '앤', '북스', '이순신', '전설', '명장', '제독', '추앙', '반면', '원균', '조선', '수군', '산채', '매장', '최악', '제독', '평가', '적군', '배', '부', '것', '척', '그', '장수', '마다', '해남', '명량대첩비', '노량해전', '끝', '임진왜란', '선조', '실록', '사관', '당시', '사람', '모두', '이순신', '산', '왜놈', '격파', '말', '아들', '이회', '등', '시신', '아산', '반장', '또한', '이순신', '아버지', '이정', '증', '충', '덕병', '보조', '공신', '대광보국숭록대부', '의정부', '좌의정', '겸', '연사', '덕', '부원군', '추증','이순신', '용모', '대해', '이순신', '생전', '초상화', '그', '얼굴', '묘사', '기록', '남아', '뿐', '주화', '이순신', '제독', '복식', '이순신', '제독', '초상화', '중', '갑옷', '전립', '관복', '차림', '이순신', '초상화', '영의정', '예우', '실제', '이순신', '살아생전', '그', '복장', '선조', '류성룡', '효종', '정조', '김육', '오윤겸', '홍석주','현대', '서도', '충무공', '거의', '완전무결', '인물', '성자', '영웅', '것', '천관우', '등', '이순신', '대한', '평가', '아주', '당신', '나라', '이순신', '제독', '나', '스승', '실로', '존경', '만', '인물', '나', '그', '두려움', '음식', '며칠', '몇', '날', '수가', '앞', '전쟁', '임해', '장수로', '나', '직무', '수', '의문', '이순신', '일기', '시조', '한시', '등', '여러', '편의', '작품']

    print("단어 수 : ", len(wordlist))
    # 결과 : 단어 수 :  237

    print("중복된 단어 제거 후의 단어 수 : ", len(set(wordlist)))
    # 결과 : 중복된 단어 제거 후의 단어 수 :  182

    # 정규표현식을 이용해도 되지만 정규표현식으로 각 품사별로 단어를 구분할 수는 없다!

    word_dict = {} 
    # 단어의 발생횟수를 dict type으로 저장
    for i in wordlist:
        if i in word_dict:
            word_dict[i] += 1
        else:
            word_dict[i] = 1
    print("word_dict : ", word_dict)
    # 결과 : word_dict :  {'그': 6, '활': 1, '무과': 1, '급제': 1, '발신': 1, '또': 1, '말타': 1, '활쏘기': 1, '글씨': 1, '당시': 3, '조산': 1, '만호': 1, '이순신': 15, '북방': 1, '여진족': 1, '약탈': 1, '및': 2, '침략': 1, '예상': 1, '수비': 1, '위': 1, '차례': 1, '북': 2, '병사': 2, '이일': 2, '추가': 1, '병력': 1, '요청': 1, '모두': 2, '거절': 1, '이': 2, '패전': 1, '책임': 2, '지게': 1, '죄': 1, '수금': 1, '백의종군': 1, '원균': 2, '대립': 1, '각기': 1, '정': 1, '파적': 1, '입장': 2, '갈등': 1, '심화': 1, '선조': 4, '실록': 3, '수정': 1, '두': 1, '인물': 3, '대한': 4, '차이': 1, '논의': 1, '뿐': 2, '임진왜란': 2, '논공': 1, '행상': 1, '자리': 1, '진위': 1, '당부': 1, '논란': 1, '미국': 1, '영국': 1, '해군': 1, '교과서': 1, '책': 1, '해전': 1, '모든': 1, '것': 3, '휴먼': 1, '앤': 1, '북스': 1, '전설': 1, '명장': 1, '제독': 5, '추앙': 1, '반면': 1, '조선': 1, '수군': 1, '산채': 1, '매장': 1, '최악': 1, '평가': 2, '적군': 1, '배': 1, '부': 1, '척': 1, '장수': 1, '마다': 1, '해남': 1, '명량대첩비': 1, '노량해전': 1, '끝': 1, '사관': 1, '사람': 1, '산': 1, '왜놈': 1, '격파': 1, '말': 1, '아들': 1, '이회': 1, '등': 3, '시신': 1, '아산': 1, '반장': 1, '또한': 1, '아버지': 1, '이정': 1, '증': 1, '충': 1, '덕병': 1, '보조': 1, '공신': 1, '대광보국숭록대부': 1, '의정부': 1, '좌의정': 1, '겸': 1, '연사': 1, '덕': 1, '부원군': 1, '추증': 1, '용모': 1, '대해': 1,'생전': 1, '초상화': 3, '얼굴': 1, '묘사': 1, '기록': 1, '남아': 1, '주화': 1, '복식': 1, '중': 1, '갑옷': 1, '전립': 1, '관복': 1, '차림': 1, '영의정': 1, '예우': 1, '실제': 1, '살아생전': 1, '복장': 1, '류성룡': 1, '효종': 1, '정조': 1, '김육': 1, '오윤겸': 1, '홍석주': 1, '현대': 1, '서도': 1, '충무공': 1, '거의': 1, '완전무결': 1, '성자': 1, '영웅': 1, '천관우': 1, '아주': 1, '당신': 1, '나라': 1, '나': 3, '스승': 1, '실로': 1, '존경': 1, '만': 1, '두려움': 1, '음식': 1, '며칠': 1, '몇': 1, '날': 1, '수가': 1, '앞': 1, '전쟁': 1, '임해': 1, '장수로': 1, '직무': 1, '수': 1, '의문': 1, '일기': 1, '시조': 1, '한시': 1, '여러': 1, '편의': 1, '작품': 1}

    # wordlist(list)를 Series로 저장
    print("\n 뽑아온 데이터를 Series로 출력 ------")
    seri_list = pd.Series(wordlist)
    print(seri_list[:3])
    print(seri_list.value_counts()[:5])
    print()

    # word_dict(dict)를 Series로 저장
    seri_dict = pd.Series(word_dict)
    print(seri_list[:3])
    print(seri_list.value_counts()[:5])
    print()

    # seri_list(wordlist(list)가 Series가 된 것)를 DataFrame으로 저장
    print("\n 만든 Series로 DataFrame 출력 ------")
    df1 = pd.DataFrame(wordlist, columns = ['단어'])
    print(df1.head(3))
    print()

    # seri_dict(word_dict(dict)가 Series가 된 것)를 DataFrame으로 저장
    df2 = pd.DataFrame([word_dict.keys(), word_dict.values()])
    print(df2)
    print()

    df2 = df2.T
    df2.columns = ['단어', '빈도수']
    print(df2.head())
    # 결과 : 
    #       단어  빈도수
    #     0   그    6
    #     1   활    1
    #     2  무과   1
    #     3  급제   1
    #     4  발신   1

    result = df2[df2['빈도수'] >= 5]
    # 5회 이상 등장하는 단어만 뽑아라

    print('5회 이상 등장하는 단어는 ... ', result)
    # 결과 :       단어  빈도수
    #         0     그      6
    #        12  이순신    15
    #        74    제독     5

    print('전체 단어가 등장하는 빈도수는 ... ', df2['빈도수'].sum())
    # 결과 : 237

    print('각 단어별 평균적으로 출현하는 빈도수는 ... ', df2['빈도수'].mean())
    # 결과 : 1.3021978021978022

# 정리 : 
# 외부 웹(위키백과)에서 내가 원하는 데이터(한글or영어로 작성된 긴 글)를 가져온다. 
# 가져온 데이터(긴 글)에 대해서 내가 원하는 단어들만 여러 기준 별로 정리하여 DataFrame으로 만들수 있다. 
# 그때 numpy메서드를 사용하면 각 단어 출현 횟수에 대해서 연산이 가능하다.

