# numpy의 ndarray는 단순한 배열이라기 보다는 벡터/행열 연산도 가능한 다차원 수치 데이터 구조이다.
# 다차원이라는 점에 주의하자. 2차원, 3차원...이 가능하다
# 다차원 배열을 만들어서 '벡터'연산이 가능하다. = 선형대수학 기반의 연산이 가능하다!!

# ndarray : numpy에서 사용하는 다차원 배열 = 행열 구조의 데이터셋(차원이 존재)

# 주요 특징 : 
# 1. 동일한 데이터 타입(Homogeneous)
# 2. 빠른 연산 속도
# 3. 메모리 효율성


import numpy as np

# < list의 경우 >
ss = ['tom', 'james', 'oscar', 1, True]
# list 여러 type의 자료로 구성
print(ss, ' ', type(ss)) 
# 아직 아무 짓도 하지 않은 단순한 list자료형
# 결과 : ['tom', 'james', 'oscar', 1, True] <class 'list'>

# < array의 경우 >
ss2 = np.array(ss) 
# list type의 자료를 array 자료로 변환하는 코드 
# = list자료는 1차원 배열이기 때문에 형태는 같아도 list인지 array인지 구별할 수 있다.

print(ss2, ' ', type(ss2)) 
# 결과 : ['tom' 'james' 'oscar' '1' 'True'] <class 'numpy.ndarray'> 

# 배열로 바뀔 시 모두 동일한 문자열(str) type으로 들어간다. 
# 즉, list가 array로 바뀌게 되면 그 안에 들은 데이터들은 모두 동일한 type의 데이터셋으로 바뀐다.  
# 모든 데이터가 문자열로 바뀌게 되어 ''가 붙는다. 

# 그럼 항상 문자열로만 바뀔까? 그건아니다.
# type 순서 : bool(5등) -> int(4등) -> float(3등) -> complex(2등)(ex) a = 3 + 2j) -> str(1등) 
# 데이터 타입이 다르면 동일한 데이터 type으로 맞춰서 바꿔준다.
# 위 순서에 따라서 str인 문자가 없고 complex형태의 데이터가 있으면 모든 ndarray의 데이터가 complex형태로 바뀌게 된다.
# 이제부터는 ss2의 벡터 연산이 가능해졌다.

# 지금부터는 ss2라는 1차원 ndarray의 데이터들은 모두 문자열이고 해당 ndarray를 가지고 놀아보자.



# <1. 메모리 비교 : list vs array>
print("\n <1. 메모리 비교 : list vs array>")

# <list의 주소>
li = list(range(1, 10)) # 1부터 10까지의 숫자의 범위(range)를 가지고 있는 list형태의 자료를 li변수에 저장해라
print(li) 

# 결과  :  li = [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(id(li[0]), id(li[1]), hex(id(li[0])),hex(id(li[1]))) 
# 결과 : 140737196319864 140737196319896 0x7fffee97e478 0x7fffee97e498
# 리스트에서는 각 데이터들의 주소가 모두 다르다.
# id -> 단순 숫자로만 출력
# hex -> 16진수로 출력 

# list 반복하기
print(li * 10)
# li를 10번 반.복.해라
# 각 요소별 * 10(곱하기 10)이 아니라 10회 반복을 의미한다.
# li가 10번 반복한 값이 list로 출력된다.

# list와 arrat의 주소 참조 과정
# list : 각 칸에 데이터값이 아닌 주소값이 들어있다. 그래서 내가 원하는 순서의 데이터값을 호출하게 되면 각 칸이 가지고 있는
#        주소를 참조하여 그 주소가 가지고 있는 데이터값을 가리킨다.
# array : 이미 각 칸에 데이터 값 그 자체가 존재한다. 여기서 내가 원하는 순서의 데이터를 호출하게 되면 첫번째 칸의 데이터가 가지고 있는 
#         주소값에 해당 칸까지 이동하는 경로를 계산한 후 그 칸으로 이동하게 만든다. 
#         그럼 해당 칸에서 따로 주소를 참조하지 않고 곧바로 값을 얻게 된다.

print()

# list의 각 데이터에 10 곱하기
print("--" * 50)
for i in li:
    print(i*10, end=' ')
# 각 요소에 10을 곱하고 싶으면 이렇게 작성한다. 하나씩 뽑아서 뽑은 하나의 값에 *10을 해준다.

print()
# <array의 주소>
num_arr = np.array(li) # list형 자료였던 li를 array로 바꿈
# 중요하니까 외워라. np.arry(list형태의 자료를 저장한 변수) : 해당 변수를 배열로 바꾼다.

print("list와 array의 주소 참조 결과 : 1번째 2번째 데이터")

print(li[0], ' ', li[1], ' ', id(li[0]), ' ',id(li[1]))
# 결과 : 1   2   140712755389560   140712755389592
print(num_arr[0], ' ', num_arr[1], ' ', id(num_arr[0]), ' ', id(num_arr[1])) 
# 결과 : 1   2   2120205722288   2120205722288

# ** list는 li[0]으로 0번째 의 값의 id(주소값)을 그대로 나타낸다. 마찬가지로 li[1]로 1번째의 값의 id(주소값)을 보여준다.
# 그때 기존에 먼저 존재하고 있던 id(li[0])을 먼저 표현하고 그 다음 id(li[1])을 표현하기에 두 주소는 값이 다르다. 
# list는 li[0/1]을 통해 임시 스칼라 객체를 생성할 필요가 없다. 왜냐하면 이미 각 칸이 주소를 나타내고 있기 때문이다.
# 즉, 두 칸의 값은 아예 서로 다른 주소를 가지고 
# 반변에 array는 num_arr[0]을 통해서 임시 스칼라 객체를 만들었다
# 왜? 해당 칸에는 주소가 아닌 각 데이터값이 그대로 들어있기 때문이다. 
# 그래서 해당 칸의 값의 주소를 보여줄 임시 스칼라 객체를 num_arr[0/1]로 만든다.
# 그리고 id()를 하게 되면 새로 생긴 임시 스칼라 객체가 자신의 주소를 보여준다.
# 하지만 이때 임시 스칼라 객체는 id()를 통해서 자신의 주소를 보여주게되면 사라진다.
# 그리고 다음에 다시 id()를 쓰면 첫번째 참조 주소값부터 다시 시작하기에(재사용이 가능하다) 두 id(num_arr[0])과 id(num_arr[1])
# 이 동일한 주소를 가지는 것 처럼 보인다. 

# 인덱스로 데이터를 구분할 수 있다.
# num_arr[0] 배열 내부 원소를 읽어서 numpy scale 객체로 꺼냄
# 그래서 array는 동일 주소로 나오게 된다.

# list는 내부 데이터들의 객체 주소가 모두 다르지만 array는 내부 데이터들의 객체 주소가 모두 같다.
print(num_arr * 10) # 결과 : [10 20 30 40 50 60 70 80 90]

# li * 10 : "li를 10번 반복해~""
# num_arr * 10 : "arr의 요소에 10씩 곱해서 출력해~"

print()



# < 2. 차원 >
print("< 2. 차원 >")
b = np.array([[1, 2, 3], 
             [4, 5, 6]])
# 배열임을 선언할 때 np.array를 붙여준다.
# python의 중첩리스트를 배열화 = 2개의 행, 3개의 열 형태의 '배열'이 된다.

# 결과
print(b, ' ', b.shape, ' ', b.ndim, ' ', b.size) 
# 결과 : [[1 2 3]
#         [4 5 6]]   (2, 3)   2   6  -> 2행3열 짜리 배열을 의미한다. 

# b : 해당 배열의 모양(직관적인)
# b.shape : 해당 배열의 정보 -> (몇 행?, 몇 열?)
# b.ndim : 해당 배열의 차원은? -> 몇 행인지를 보여준다.
# b.size : 해당 배열의 모든 데이터 값의 갯수

print(b[0], ' ', b[[0]], ' ', b[0, 0]) 
# 결과 : [1 2 3]   [[1 2 3]]    1

# b[0] : 0번째 행의 데이터를 1차원 배열로 반환
# b[[0]] : 0번째 행의 데이터를 2차원 배열로 반환(괄호가 2개이다)
# b[0,0] : 0번째 행의 0번째 데이터
print()



# < 3. 배열 선언 후 자동으로 값 채우기 >
print("< 3. 배열 선언 후 자동으로 값 채우기 >")

c = np.zeros((2, 2))
# np.zeros는 해당 모양을 가지는 (2,2) -> 2행2열인 모든 값이 '0'인 배열을 만들라는 뜻이다.
print(c)
# 결과 : [[0. 0.]
#         [0. 0.]]

d = np.ones((2, 3))
# np.ones는 해당 모양을 가지는 (2,3) -> 2행3열인 모든 값이 1인 배열을 만들어라는 뜻
print(d)
# 결과 : [[1. 1. 1.]
#         [1. 1. 1.]]
# 모든 행렬을 1로 채움

e = np.eye(3)
# np.eye는 대각선은 1이고 나머지는 0인 배열을 만드라는 뜻이다. 3이라는 수는 행과 열의 공통된 수이다.
print(e)
# 결과 : [[1. 0. 0.]
#         [0. 1. 0.]
#         [0. 0. 1.]]
# 단위 행렬(주 대각선은1, 나머지는 0으로 채움)

print()



# < 4. 난수 발생에서의 '분포' >
print("< 4. 난수 발생에서의 '분포' >")
# np.random -> 난수 발생. 실행할 때마다 무작위의 숫자들이 나온다. 등차/등비수열도 아니고 전혀 상관없는 숫자가 나온다.

# 그때 'rand'와 'randn'
print(np.random.rand(5))   # rnad  ->  균등 분포 (0이상 1미만의 난수)한 상태의 난수 5개 발생(0 ~ 1)
print(np.random.randn(5))  # randn -> 정규 분포  (평균 = 0, 표준편차 = 1 인 분포 생성)한 상태의 난수 5개 발생(-1 ~1)

# ** 균등분포 : 모든 값이 일정하게 등장한다. = 즉 해당 구간에서 높이가 일정하다
# ** 정규분포 : 가운데가 가장 높게 나타나고 양쪽 꼬리는 그림 밖으로도 계속 이어진다.

np.set_printoptions(threshold=np.inf) # 너무 길면 ...이 나오는데 이를 무시하고 전체 수를 다 보여줘
# np.set_printoptions : 배열 출력 방식 결정
# threshld : 생략 여부를 결정하는 원소 개수 기준 
# np.inf : 기준을 무한대로 설정
# = 앞으로 np가 가리키는 값을 모두 보여줘.

print("결과")
print(np.mean(np.random.rand(5000))) # 균등 분포의 난수 5000개가 나오는데 그 난수들의 mean(평균)은 0.5에 가까워진다. = 0과1미만의 난수이기 때문
# 결과 : 0.49903711584036936 (0 ~ 1)
print(np.mean(np.random.randn(5000))) # 정규 분포의 난수 5000개가 나오는데 그 난수들의 menan(평균)은 0에 가까워진다. = -1 / 0 / 1 : 평균인 0을 중심으로 좌우 대칭이기 때문 = 가우스 대칭구조 : 평균에 가까워질수록 데이터의 수가 많아지고 멀어질수록 데이터가 적어진다.
# 결과 : 0.015193044913755971 (-1 ~ 1)
print(np.random.randn(2, 3)) # 2행 3열짜리 난수가 나온다. 그때 그 난수들은 정규분포 형태이다

# 이렇게 난수는 모든사람이 다 다르게 나오지만 우리는 이 난수를 다른사람들과 동일한 값으로 고정시키고 싶다. 그때 .seed(숫자)를 사용한다. 
# 난수표의 특정 인덱스(규보형의 의견)값을 선택하여 고정시키는 것이다. = 난수의 시작 상태를 고정한 것
# 주로 42를 많이 쓴다.
np.random.seed(42)

print()



# < 5. 인덱싱과 슬라이싱 >
print("< 5. 인덱싱과 슬라이싱 >")
aa = np.array([1, 2, 3, 4, 5]) 
# 이 자리에 list, tuple, set자료가 올 수 있다. 그러면 그때 np.array로 배열 type으로 바꿀 수 있다.
# 어차피 배열로 바뀌게 되면 무조건 배열로써 각 객체를 바라보기 때문이다.
# 하지만 dict는 안된다.

# 5-1. 인덱싱
print(aa, ' ', aa[1]) # 인덱싱은 '0'부터 시작한다.
# 현재 1행 5열짜리의 배열이다.

# 5-2. 슬라이싱
print(aa[1:4]) # a의 1번째에서부터 4번째 전(3번째 = 4미만) 인덱스값까지 출력
print(aa[1:])  # a에서 인덱스 1이상 모든 인덱스값 출력
print(aa[0:])  # a의 모든 값 출력
print(aa[0:5:1]) # a배열에서 0번째부터 5미만번째까지 1을 증가치로 인덱스값으로 출력(증가치1은 생략가능) -> [start : end : step(+/=)]
print(aa[-2:]) # 뒤에서부터 -1번째, 0번째 인덱스 값을 출력(뒤에서부터는 -1부터 시작)

print()


# < 6. 주소 치환 >
print("< 6. 주소 치환 >")
bb = aa
# 현재는 aa는 배열이다.
print(aa)
print(bb)
print(id(aa), ' ', id(bb)) # 결과 : 2129257612464   2129257612464
# 주소를 치환했기에 두 주소는 같다. 하나의 변수를 두 주소가 참조하고 있는 것이다.

# 6-1. 서로 같은 주소
bb[0] = 99 # aa와 bb는 같은 주소를 참조하고 있는데 bb의 배열의 구조를 바꿈.
print(bb) # 결과 : [99  2  3  4  5]
print(aa) # 결과 : [99  2  3  4  5]
# bb를 바꾸게 되면 aa의 배열 구조도 변경된다. -> 서로 같은 주소를 참조하고 있기 때문

# 6-2. 서로 다른 주소
cc = np.copy(aa) # 복사본 별도 생성 .. 이건 참조하는 것이 아님 .. 서로 다른 주소를 참조
# 아예 새로운 객체가 생성되었다
# aa와 bb배열은 서로 동일한 객체를 바라보기에 수정을 하면 수정사항이 서로에게 반영되지만
# cc는 모양만 똑같은 배열을 새로 복사하여 새로운 객체를 생성한 독립 객체이다.
print(aa)
print(cc)

cc[0] = 77
print(aa) # 결과 : [99  2  3  4  5] 
print(cc) # 결과 : [77  2  3  4  5]
print(id(aa), ' ', id(cc))
# 둘 다 서로 같이 참조하게 된다.
# aa와 cc는 애시당초 두 주소값이 다르다.

print("---------------------------------------------------------------------------------------------------------------------------------------")

# 여기서부턴 중요!!

# < 7. 2차원 배열의 인덱싱과 슬라이싱>
print("< 7. 2차원 배열의 인덱싱과 슬라이싱>")
dd = np.array([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
])
print(dd, '\n', dd.shape) # dd.shape는 몇행 몇열인지를 나타내는 명령어다.
# 결과 : (3, 4)


# 7-1. 인덱싱(2차원배열)
print("-- 2차원 배열을 인덱싱을 하면? --")
print(dd[0]) # dd의 0행의 모든 요소 출력 
# 결과 : [1, 2, 3, 4]
print(dd[0, 0]) # dd의 0행 0열 
# 결과 : 1
print(dd[2, 3]) # dd의 2행 3열 
# 결과 : 12


# 7-1. 슬라이싱(2차원배열)
print("-- 2차원 배열을 슬라이싱을 하면? --")

# 7-1.1. 슬라이싱(2차원배열) - 행
print(dd[0:2]) # 0행 이상 2행 미만(0,1행)
# 결과 : [[1, 2, 3, 4]
#         [5, 6, 7, 8]]
print(dd[1:])  # 1행 이상 모든 행 출력(1,2행)
# 결과 : [[5, 6, 7, 8]
#         [9, 10, 11, 12]]


# 7-1.2. 슬라이싱(2차원배열) - 열
# ,는 행과 열을 구분한다      -> 행, 열
# :는 선택할 범위를 지정한다. -> 몇 행(이상) : 몇 행(미만)

# 변수[ a : A , b : B]
# a, A가 '행'을 나타내고 b, B가 '열'에 대한 정보를 나타낸다.
# a번째 행부터 A-1번째까지 행에서
# b번째 열부터 B-1번째 열까지를 보여줘.라는 뜻이다.

print(dd[:,0])      # 모든 행의 0번째 열 -> 1차원 형태
print(dd[:0]) # 아무것도 안뜬다 : 처음 행부터 0행의 바로 전 행은 존재하지 않기 땜누이다.
print(dd[:, [1]])   # 모든 행의 1번째 열을 가져오되, 2차원 형태를 유지한다(파란색 대괄호의 중요) -> 2차원 형태
print(dd[:, 1])     # 모든 행의 1번째 열을 가져와라. 그때 1차원 형태를 보여준다.
print(dd[1:3, 1:3]) # 1행, 2행의 / 1열, 2열 출력 # 결과 : [[ 6  7]
#                                                         [10 11]]
# 행의 범위(1:3)과 열의 범위(1:3)이 겹치는 부분을 출력해라라는 뜻

# [초기값 : 끝(미만)값 : 증가치]
print(dd[::])      # 모든 행, 모든 열 출력
print(dd[::2, :])  # 0행과 2행의 모든 열  # 결과 : [[ 1  2  3  4]
#                                                  [ 9 10 11 12]]
print(dd[::, ::2]) # 모든 행, 0열, 2열 출력  # 결과 : [[ 1  3]
#                                                     [ 5  7]
#                                                     [ 9 11]]
print(dd[::2, ::2]) # 0행과 2행의 0열, 2열 출력  # 결과 : [[ 1  3]
#                                                         [ 9 11]]
print(dd[-1, -1]) # 마지막행, 마지막 열 값 1개 출력  # 결과 : 12
print(dd[-1])     # 마지막행 모든 열  # 결과 : [ 9 10 11 12]
print(dd[:, -1])  # 모든 행의 마지막 열  # 결과: [ 4  8 12]

# 7-1-3. 행열 역순
print(dd[::-1])    # 행역순
# 결과 : [[ 9 10 11 12]
#         [ 5  6  7  8]
#         [ 1  2  3  4]]

print(dd[:, ::-1]) # 열역순
# 결과 : [[ 4  3  2  1]
#         [ 8  7  6  5]
#         [12 11 10  9]]

print(dd[::-1, ::-1]) # 행 역순  + 열 역순
# 결과 : [[12 11 10  9]
#         [ 8  7  6  5]
#         [ 4  3  2  1]]