# 이번엔 배열을 연산해보자.
# 기본수학함수는 배열에 요소별로 적용되고, +, -, *, / 또는 add(), subtract(), multiply(), divide()함수를 사용
# 벡터화 연산을 하므로 for문을 사용하지 않고 바로 배열에 대한 연산 가능하다.

import numpy as np


# 1. dtype변경
x = np.array([
    [1,2],
    [3,4]
    ])
# x는 (2,2)의 배열이다
print(x, ' ', x.dtype)  
# 결과 : [[1 2]
#        [3 4]]   int64

x = np.array([
    [1,2],
    [3,4]
    ], dtype=np.float32) # 각 원소를 32비트 정수로 저장해라
print(x, ' ', x.dtype) 
# 결과 : [[1. 2.]
#        [3. 4.]]   float32

# dtype의 종류
# int64(정수), float32(실수), bool(참/거짓), complex128(복소수)

x = np.array([
    [1.,2],  # 하나의 원소를 '1.'으로 실수로 바꾸어 주었따.
    [3,4]
    ])
print(x, ' ', x.dtype) 
# 결과 : [[1. 2.]
#         [3. 4.]]   float64
# 각 원소에 데이터값 중 하나라도 .이 있으면(실수형 값이 하나라도 있으면) 실수로 받아들여져서 float64가 기본값으로 책정된다.

# **int vs float** : 정수와 실수를 의미
# 32  vs  64  :  원소 하나를 저장하는 비트 수
# 정수형(int)은 비트 수가 클수록 더 큰 정수를 정확하게 저장할 수 있다.
# 실수형(float)은 비트 수가 클수로 더 넓은 범위와 더 높은 정밀도를 제공한다.
# 동일한 갯수의 원소라면 64비트 자료형이 32비트 자료형보다 데이터 저장 공간을 2배 더 사용한다.

# 2. arange()함수 : 1차원 배열 생성
y = np.arange(5, 9) 
# 5 ~ 8(9-1)까지의 숫자로 '1차원'배열을 생성해라.
print(y,  ' ', y.dtype)
# 결과 : [5 6 7 8]  int64  -> 1차원 배열 생성



# 3. reshpae()함수 : 기존 배열 구조변경 
y = np.arange(5, 9).reshape(2,2) # 1차원 배열인 y를 reshape하여 (2, 2)구조로 만든다 (1차원 -> 2차원)
y = y.astype(np.float32) # type변경(int64를 float32로 바꾼다)
print(y, ' ', y.dtype) 
# 결과 [[5. 6.]
#       [7. 8.]]  float32

print(x.ndim, ' ', y.ndim) 
# 결과 : 2  2
print()



# 4. 연산
# numpy 함수(유니버셜 함수) - 위보다 연산이 빠름 : 내부적으로 벡터화하여 연산하기 때문이다.
# numpy function = universal function이다.
# 이때 x의 데이터는 np.array여야만 한다.
# 파이썬 연산자를 사용해도 되고 np.으로 연산이 가능하다. 그치만 numpy함수가 속도가 훨씬 빠르기에 np함수(유니버셜 함수)를 사용한다

# 현재 x와 y는 ndarray형태의 배열이다.

#   x = [[1.,2],
#        [3, 4]]   float 64

#   y = [[5, 6]
#        [7, 8]]   float 32

# 4-1. add()
print(x+y)
print(np.add(x, y)) # numpy 함수(유니버셜 함수) - 위보다 연산이 빠름

# 4-2. subtract()
print(x-y)
print(np.subtract(x, y))

# 4-3. multiply()
# 4-3-1. '하다마르 곱'
print(x * y)
print(np.multiply(x, y))
# 하다마르 곱과 내적
# np.multiply(x,y)는 '하다마르 곱'이다.
# = 이는 위치별 곱셈만 진행하게 된다.
# 결과 : [[5, 12],
#         [21, 32]]

# 4-3-2. '내적'
# '내적'이란? : 다음카페/Python Analysis/선형대수학:벡터기본
print(x @ y)
print(np.dot(x, y))
# 각 행과 열에 대해서 곱한뒤 값들을 더해준다.
# 결과 : [[5+14  6+16],
#         [15+28 18+32]]
# 결과 : [[19 22],
#         [43 50]]

# 4-4. divide()
print(x/y)
print(np.divide(x, y))

# 4-5. 그 외
print(np.sqrt(x), ' ', np.exp(x), ' ', np.log(x), ' ', np.cos(x))
# np.sqrt() : 각 원소의 제곱근
# np.exp() : 자연상수e의 거듭제곱(e의 몇(원소값) 승)
# np.log() : 자연로그(밑:e)인 로그
# np.cos() : 코사인 값

print('\n 내적 : dot()은 numpy모듈의 함수나 배열 객체의 인스턴스 메서드로 내적연산이 가능하다')
v = np.array([9,10])
w = np.array([11,12])
print(v * w) # 요소별 곱셈으로 하다마르 곱셈이다. 
# 결과 : [ 99 120]  <- [ 9*11  10*12 ] : 열끼리 곱하였다.
# = v 곱하기 w (하다마르 곱)

# '행렬곱'은 어떻게?
# 벡터의 내적
print(v.dot(w)) # 내적의 결과는 스칼라값으로 크기만 있고 방향은 없다.
print(np.dot(v,w))
# 내적이란 : 하나의 숫자로 스칼라값이다. 기하학적으로 두 벡터가 얼마나 같은 방향을 향하는지와 관련
# 내적이 양수 -> 두 벡터 사이의 각도가 90도 보다 작음
# 내적이 0    -> 두 벡터가 수직
# 내적이 음수 -> 두 베거 사이의 각도가 90도 보다 큼

# 결과 : 219  <-  (9*11) + (10*12) : 열끼리 곱한 값을 서로 더한다. 스칼라 값이 219가 나온다
# 우리가 이후 배울 y = wx + b에서 wx에 "행렬곱"이 사용되는 "내적"이다.
# 만약 v와 w가 array가 아닌 list자료라면 v.dot(w) 계산이 error가 뜬다. 벡터가 아니기 때문에 벡터연산이 불가능하기 때문
# 벡터 자료형이 따로 있는 것은 아니다. 만약 리스트형 자료에 ndarray를 선언하면 벡터가 된다. 그 벡터가 모이면 array가되고 array가 모여 tensor가 된다.
# 머신러닝과 딥러닝에서는 거의 모든 데이터를 베건타 행렬형태로 바꾸어서 처리한다.

# 내적을 계산하는 2가지 방법
# 내적을 계산하는 이유? : 두 벡터(행렬)의 내적을 계산하면 두 벡터의 화살표의 관계를 알 수 있다.

# 방법1 : |a| * |b| * cos@
#         여기서 a와 b의 길이는 피타고라스 정리를 사용하여 구한다.
# print(np.linalg.norm(v)), print(np.linalg.norm(w))을 사용하여 해당 벡터의 화살표 길이(|a|, |b|)를 구할 수 잇다.
print(np.linalg.norm(v))
# 결과 : 13.45362404707371
print(np.linalg.norm(w))
# 결과 : 16.278820596099706
# 그리고 코사인 값 구하기
# 1. 아래 방법(원소의 곱 후 더하기)으로 내적값을 구한다 = 219 
# 2. 내적값 / {두 화살표의 길이의 곱(13 * 16)} = 219 / 219.009 = 0.999958
# 3. 역코사인 값 적용 : 0.999958의 역코사인 값 = cos@

# 방법2 : (a1 * b1) + (a2 * b2)


print()

# 배열 계산 함수 : axis(축)을 지정하지 않고 집계함수(우니버셜 함수)를 사용하면 전체 배열의 차원을 떨어트린다.)
# axis = 0
# axis = 1
# 을 생략하게 되면 해당 배열의 차원을 하나 떨어트린다.
print("------ 배열 계산 함수 ------")

print(x)
# 결과 : [[1. 2.]
#         [3. 4.]]

print(np.mean(x), ' ', np.var(x))
# 평균과 분산
# 결과 : 2.5   1.25
# x는 2차원인데 평균과 분산의 값은 1차원으로 나온다.
# 축을 지정하지 않으면 전체 원소를 대상으로 값을 구한다.
# 그러니 축을 꼭 지정하자!!

print(np.max(x), ' ', np.min(x))
# 최댓값과 최솟값
# 결과 : 4.0   1.0

# 축을 써보자!
print(np.max(x, axis = 0)) # axis = 0 -> 각 열에서...
print(np.max(x, axis = 1)) # axis = 1 -> 각 행에서...
# 과 같이 axis로 축을 표현해주면
# 결과 : [3. 4.] : 각 열에서의 최댓값
# 결과 : [2. 4.] : 각 행에서 최댓값

print(np.argmax(x), ' ', np.argmin(x))
# index를 반환하는 최댓값과 최솟값
# 전체 원소 4개 중 최댓(솟)값을 가진 '값'의 인덱스를 보여준다.
# 결과 : 3  0

print(np.cumsum(x))
# 누적합 연산
# 모든 원소에 대하여 누적합을 보여준다.
# 앞에서 부터 더한 값을 모두 저장한다.
# 결과 : [ 1.  3.  6. 10.]

print(np.cumprod(x))
# 누적곱 연산
# 앞에서부터 곱한 값을 모두 저장한다.
# 결과 : [ 1.  2.  6. 24.]

# 즉, axis=0,1이라는 축을 써주지 않으면 해당 '열'에서, 해당 '행'에서로 기준을 잡지 않고
# 전체 원소를 기준으로 계산한다.
print()

names1 = np.array(['tom', 'james', 'tom', 'oscar'])
names2 = np.array(['tom', 'page', 'john'])
print(np.unique(names1))
# unique함수는 'names1'라는 배열변수에서 중복값을 제거하고 고유한 값을 정렬해서 반환한다.
# 결과 : ['james' 'oscar' 'tom']

print(np.intersect1d(names1, names2))
# 교집합(중복X)
# 결과 : ['tom']

print(np.intersect1d(names1, names2, assume_unique = True))
# 교집합(중복ㅇ)
# assume_unique = True : 입력된 배열 각각에 중복된 원소가 없다고 가정해라. = 각 배열 안에서 중복 값이 없다고 보아라.
# 결과 : ['tom' 'tom']

print(np.union1d(names1, names2))
# 합집합(중복x)
# 결과 : ['james' 'john' 'oscar' 'page' 'tom']
print()

print("중요!! -> '전치'와 '브로드캐스팅'")
print('\n 전치(Transpose) - 2차원 배열에서 행과 열의 위치를 바꿈')
print(x)
# 결과 : [[1. 2.],
#         [3. 4.]]
print(x.T)
print(x.transpose())
print(x.swapaxes(0,1))
# 위 3가지 방식 모두 동일하다.
# 결과 : [[1. 3.]
#         [2. 4.]]

print('\n브로드캐스팅(Broadcasting) - 크기가 다른 배열 간의 연산 - 작은 배열을 여러 번 반복하여 큰 배열과 동일한 배열로 만들어서 연산')
# 우리가 위에서 배열간의 연산을 할때는 둘다 2차원 배열일 때 연산을 하였다
# 하지만 만약 연산하는 두 배열간의 차원이 맞지 않을 때는 어떻게 계산할까?
# 그때는 브로드캐스팅으로 모양을 맞추어서 연산한다.
# 실제로 y라는 열을 늘리는 건 아니지만 x와 행을 맞추어 늘어난 것처럼 계싼한다. = 그렇게 각 원소에 하나씩 대응하여 연산한다.
x = np.arange(1, 10).reshape(3,3)
y = np.array([1, 0, 1])

print(x) # (3,3)
# 결과 : [[1 2 3],
#         [4 5 6],
#         [7 8 9]] 

print(y) (1,3)
# 결과 : [1 0 1]

print(x+y)
# 서로 다른 배열을 더하게 되면 각 배열의 원소에 더한다.
# 결과 : [[ 2  2  4]
#        [ 5  5  7]
#        [ 8  8 10]]
# y배열을 (3, 3)으로 만든다.

# 차원이 서로 다를 때 곱하기
# 1. 하다마르 곱 그냥
# 2. 내적곱 : x의 열개수와 y의 원소의 개수가 반드시 같아야한다.
# 
print()

print("열 자료를 파일로 저장")
# 배열자료를 파일로 저장

# 1. np.savetxt : 배열을 파일로 저장함.
np.savetxt("numpy2.txt", x)
# x의 값을 numpy2.txt라는 파일을 만들어서 저장해라.

# 2. np.loadtxt : 파일의 배열을 불러옴
imsi = np.loadtxt("numpy2.txt")
# 해당 파일에 저장한 배열을 다시 읽어서 출력한다
print(imsi)

