# numpy의 ndarray는 단순한 배열이라기 보다는 벡터/헹열 연산도 가능한 다차원 수치 데이터 구조이다.
# 다차원이라는 점에 주의하자. 2차원, 3차원...이 가능하다

# 주요 특징 :
# 1. 동일한 데이터 타입(Homogeneous)
# 2. 빠른 연산 속도
# 3. 메모리 효율성


import numpy as np

# < list의 경우 >
ss = ['tom', 'james', 'oscar', 1, True]
# list 여러 type의 자료로 구성
print(ss, ' ', type(ss)) # 결과 : ['tom', 'james', 'oscar', 1, True] <class 'list'>

# < array의 경우 >
ss2 = np.array(ss) # list type의 자료를 array 자료로 변환하는 코드 = list자료는 1차원 배열이기 때문에 형태는 같아도 list인지 array인지 구별할 수 있다.
print(ss2, ' ', type(ss2)) # 결과 : ['tom' 'james' 'oscar' '1' 'True'] <class 'numpy.ndarray'> 
# 배열로 바뀔 시 모두 동일한 문자열(str) type으로 들어간다. 모든 데이터가 문자열로 바뀌게 되어 ''가 붙는다. 그럼 항상 문자열로만 바뀔까? 그건아니다.
# type 순서 : bool(5등) -> int(4등) -> float(3등) -> complex(2등) -> str(1등) # 데이터 타입이 다르면 동일한 데이터 type으로 맞춰서 바꿔준다.
# 위 순서에 따라서 str인 문자가 없고 complex형태의 데이터가 있으면 모든 ndarray의 데이터가 complex형태로 바뀌게 된다.
# 이제부터는 ss2의 벡터 연산이 가능해졌다.

# 지금부터는 ss2라는 1차원 ndarray의 데이터들은 모두 문자열이고 해당 ndarray를 가지고 놀아보자.



# <1. 메모리 비교 : list vs array>
print("\n<1. 메모리 비교 : list vs array>")
# <list의 주소>
li = list(range(1, 10)) # 1부터 10까지의 숫자의 범위(range)를 가지고 있는 list형태의 자료를 li변수에 저장해라
print(li) # 결과  : [1, 2, 3, 4, 5, 6, 7, 8, 9]
print(id(li[0]),id(li[1]), hex(id(li[0])),hex(id(li[1]))) # 결과 : 140737196319864 140737196319896 0x7fffee97e478 0x7fffee97e498
# id -> 단순 숫자로만 출력
# hex -> 16진수로 출력 
print(li * 10)
# li를 10번 반.복.해라
# 각 요소별 * 10(곱하기 10)이 아니라 10회 반복을 의미한다.
# li가 10번 반복한 값이 list로 출력된다.

print()
print("--" * 50)
for i in li:
    print(i*10, end=' ')
    # 각 요소에 10을 곱하고 싶으면 이렇게 작성한다. 하나씩 뽑아서 뽑은 하나의 값에 *10을 해준다.

print()
# <array의 주소>
num_arr = np.array(li) # list형 자료였던 li를 array로 바꿈
# 중요하니까 외워라. np.arry(list형태의 자료를 저장한 변수) : 해당 변수를 배열로 바꾼다.

print(num_arr[0], ' ',num_arr[1], ' ',id(num_arr[0]), ' ',id(num_arr[0])) # 결과 : 1   2   2120205722288   2120205722288
# 인덱스로 데이터를 구분할 수 있다.
# num_arr[0] 배열 내부 원소를 읽어서 numpy scale 객체로 꺼냄
# 그래서 array는 동일 주소로 나오게 된다.

# list는 내부 데이터들의 객체 주소가 모두 다르지만 array는 내부 데이터들의 객체 주소가 모두 같다.
print(num_arr * 10) # 결과 : [10 20 30 40 50 60 70 80 90]

# li * 10 : "li를 10번 반복해~""
# num_arr * 10 : "arr의 요소에 10씩 곱해서 출력해~"

print()



# < 2. 차원 >
print("< 2. 차원 >")
b = np.array([[1, 2, 3], [4, 5, 6]])
# 배열임을 선언할 때 np.array를 붙여준다.
# python의 중첩리스트를 배열화 = 2개의 행, 3개의 열 형태의 '배열'이 된다.

# 결과
print(b, ' ', b.shape, ' ', b.ndim, ' ', b.size) # 결과 : [[1 2 3]
#                                                          [4 5 6]]  (2, 3)   2   6  -> 2행3열 짜리 배열을 의미한다. 

print(b[0], ' ', b[[0]], ' ', b[0, 0]) # 결과 : [1 2 3]   [[1 2 3]]    1
# b[0] : 0번째 행의 데이터를 1차원 배열로 반환
# b[[0]] : 0번째 행의 데이터를 2차원 배열로 반환
# b[0,0] : 0번째 행의 0번째 데이터
print()



# < 3. 배열 선언 후 자동으로 값 채우기 >
print("< 3. 배열 선언 후 자동으로 값 채우기 >")

c = np.zeros((2, 2))
# np.zeros는 해당 모양을 가지는 (2,2) -> 2행2열인 모든 값이 0인 배열을 만들라는 뜻이다.
print(c)
# 결과 : [[0. 0.]
#         [0. 0.]]

d = np.ones((2, 3))
# np.ones는 해당 모양을 가지는 (2,3) -> 2행3열인 모든 값이 1인 배열을 만들어라는 뜻
print(d)
# 결과 : [[1. 1. 1.]
#         [1. 1. 1.]]
# 모든 행렬을 1로 채움

e = np.eye(3)
# np.eye는 대각선은 1이고 나머지는 0인 배열을 만드라는 뜻이다. 3이라는 수는 행과 열의 공통된 수이다.
print(e)
# 결과 : [[1. 0. 0.]
#         [0. 1. 0.]
#         [0. 0. 1.]]
# 단위 행렬(주 대각선은1, 나머지는 0으로 채움)

print()



# < 4. 난수 발생에서의 '분포' >
print("< 4. 난수 발생에서의 '분포' >")
# np.random -> 난수 발생. 실행할 때마다 무작위의 숫자들이 나온다. 등차/등비수열도 아니고 전혀 상관없는 숫자가 나온다.
# 그때 'rand'와 'randn'
print(np.random.rand(5))   # 균등 분포 (0이상 1미만의 난수)한 상태의 난수 5개 발생(0 ~ 1)
print(np.random.randn(5))  # 정규 분포 (평균 = 0, 표준편차 = 1 인 분포 생성)한 상태의 난수 5개 발생(-1 ~1)

np.set_printoptions(threshold=np.inf) # 너무 길면 ...이 나오는데 이를 무시
print(np.mean(np.random.rand(5000))) # 균등 분포의 난수 5000개가 나오는데 그 난수들의 mean(평균)은 0.5에 가까워진다. = 0과1미만의 난수이기 때문
print(np.mean(np.random.randn(5000))) # 정규 분포의 난수 5000개가 나오는데 그 난수들의 menan(평균)은 0에 가까워진다. = -1 / 0 / 1 : 평균인 0을 중심으로 좌우 대칭이기 때문 = 가우스 대칭구조 : 평균에 가까워질수록 데이터의 수가 많아지고 멀어질수록 데이터가 적어진다.

print(np.random.randn(2, 3)) # 2행 3열짜리 난수가 나온다. 

# 이렇게 난수는 모든사람이 다 다르게 나오지만 우리는 이 난수를 다른사람들과 동일한 값으로 고정시키고 싶다. 그때 .seed(숫자)를 사용한다. 
# 난수표의 특정 인덱스(규보형의 의견)값을 선택하여 고정시키는 것이다. = 난수의 시작 상태를 고정한 것
# 주로 42를 많이 쓴다.
np.random.seed(42)

print()



# < 5. 인덱싱과 슬라이싱 >
print("< 5. 인덱싱과 슬라이싱 >")
aa = np.array([1, 2, 3, 4, 5]) 
# 이 자리에 list, tuple, set자료가 올 수 있다. 그러면 그때 np.array로 배열 type으로 바꿀 수 있다.
# 어차피 배열로 바뀌게 되면 무조건 배열로 써 각 객체를 바라보기 때문이다.
# 하지만 dict는 안된다.

# 5-1. 인덱싱
print(aa, ' ', aa[1]) # 인덱싱은 '0'부터 시작한다.

# 5-2. 슬라이싱
print(aa[1:4]) # a의 1번째에서부터 4번째 전(3번째 = 4미만) 인덱스값까지 출력
print(aa[1:])  # a에서 인덱스 1이상 모든 인덱스값 출력
print(aa[0:])  # a의 모든 값 출력
print(aa[0:5:1]) # a배열에서 0번째부터 5미만번째까지 1을 증가치로 인덱스값으로 출력(증가치1은 생략가능) -> [start : end : step(+/=)]
print(aa[-2:]) # 뒤에서부터 -1번째, 0번째 인덱스 값을 출력(뒤에서부터는 -1부터 시작)

print()


# < 6. 주소 치환 >
print("< 6. 주소 치환 >")
bb = aa
print(aa)
print(bb)
print(id(aa), ' ', id(bb)) # 결과 : 2129257612464   2129257612464
# 주소를 치환했기에 두 주소는 같다. 하나의 변수를 두 주소가 참조하고 있는 것이다.

# 6-1. 서로 같은 주소
bb[0] = 99 # aa와 bb는 같은 주소를 참조하고 있는데 bb의 배열의 구조를 바꿈.
print(bb) # 결과 : [99  2  3  4  5]
print(aa) # 결과 : [99  2  3  4  5]
# bb를 바꾸게 되면 aa의 배열 구조도 변경된다. -> 서로 같은 주소를 참조하고 있기 때문

# 6-2. 서로 다른 주소
cc = np.copy(aa) # 복사본 별도 생성 .. 이건 참조하는 것이 아님 .. 서로 다른 주소를 참조
print(aa)
print(cc)

cc[0] = 77
print(aa) # 결과 : [99  2  3  4  5] 
print(cc) # 결과 : [77  2  3  4  5]
print(id(aa), ' ', id(cc))
# 둘 다 서로 같이 참조하게 된다.

print("---------------------------------------------------------------------------------------------------------------------------------------")

# < 7. 2차원 배열의 인덱싱과 슬라이싱>
print("< 7. 2차원 배열의 인덱싱과 슬라이싱>")
dd = np.array([
    [1,2,3,4],
    [5,6,7,8],
    [9,10,11,12]
])
print(dd, '\n', dd.shape) # dd.shape는 몇행 몇열인지를 나타내는 명령어다. 결과 : (3, 4)

# 7-1. 인덱싱(2차원배열)
print("-- 2차원 배열을 인덱싱을 하면? --")
print(dd[0]) # dd의 0행의 모든 요소 출력 # 결과 : [1, 2, 3, 4]
print(dd[0, 0]) # dd의 0행 0열 # 결과 : 1
print(dd[2, 3]) # dd의 2행 3열 # 결과 : 12

# 7-1. 슬라이싱(2차원배열)
print("-- 2차원 배열을 슬라이싱을 하면? --")

# 7-1.1. 슬라이싱(2차원배열) - 행
print(dd[0:2]) # 0행 이상 2행 미만(0,1행)
print(dd[1:])  # 1행 이상 모든 행 출력(1,2행)

# 7-1.2. 슬라이싱(2차원배열) - 열
# ,는 행과 열을 구분한다
# :는 선택할 범위르 지정한다
print(dd[:,0])      # 모든 행의 0번째 열 -> 1차원 형태
print(dd[:, [1]])   # 모든 행의 1번째 열을 가져오되, 2차원 형태를 유지한다(파란색 대괄호의 중요) -> 2차원 형태
print(dd[1:3, 1:3]) # 1행, 2행의 1열, 2열 출력 # 결과 : [[ 6  7]
#                                                       [10 11]]
# 행의 범위(1:3)과 열의 범위(1:3)이 겹치는 부분을 출력해라라는 뜻

# [초기값 : 끝(미만)값 : 증가치]
print(dd[::])      # 모든 행, 모든 열 출력
print(dd[::2, :])  # 0행과 2행의 모든 열  # 결과 : [[ 1  2  3  4]
#                                                  [ 9 10 11 12]]
print(dd[::, ::2]) # 모든 행, 0열, 2열 출력  # 결과 : [[ 1  3]
#                                                     [ 5  7]
#                                                     [ 9 11]]
print(dd[::2, ::2]) # 0행과 2행의 0열, 2열 출력  # 결과 : [[ 1  3]
#                                                         [ 9 11]]
print(dd[-1, -1]) # 마지막행, 마지막 열 값 1개 출력  # 결과 : 12
print(dd[-1])     # 마지막행 모든 열  # 결과 : [ 9 10 11 12]
print(dd[:, -1])  # 모든 행의 마지막 열  # 결과: [ 4  8 12]

# 7-1-3. 행열 역순
print(dd[::-1])    # 행역순
print(dd[:, ::-1]) # 열역순
print(dd[::-1, ::-1]) # 행 역순 # 결과 : [[12 11 10  9]
#                                        [ 8  7  6  5]
#                                        [ 4  3  2  1]]