# 총 3가지 방법으로 검정통계량을 구하고 그 검정통계량으로 p-value를 구한다.
# 그리고 구해진 p-value를 crystal 그래프에 표현하여 해당 값이 채택역에 있는지 기각역에 있는지 확인한 후
# 가설 검정 및 검증을 하여 해당 가설을 채택or기각 결정을 한다.

# 그때 3가지 방법으로
# 1. 카이제곱 분포 - 일원카이제곱분포(적합성 검정) / 이원카이제곱분포(독립성 검정)
# 2. t-test
# 3. anova
# 를 사용하여 p-value를 구한다.

# < 1. 교차분석(카이제곱) 가설 검정 >
# 범주형 자료(변수)를 대상으로 교차빈도에 대한 기술 통계량을 사용한다
# 교차빈도에 대한 통계적 유의성을 검증해 주는 분석 기법이다.

# 분산이 퍼져 있는 모습을 분포로 만든 것이다.
# 수식 : χ² = Σ[(관측값 - 기댓값)² / 기댓값]
# 즉, '관측값'과 '기댓값을 구해야한다. 

# 역할 : 독립성, 적합도 검정, 분산에 대한 검정, 회귀 분석의 잔차제곱합(SSE)를 분석한다.
# 특징 : 항상 양수, 비대칭적 분포로 자유도에 따라 모양이 바뀐다.

# 실습 - 적합도 검정

# 가설을 채택하는 2가지 방법(카이제곱)

# 1-1. 일원카이제곱 검정(가설채택방법1)
from pathlib import Path

import pandas as pd

# [ 1. 관측값 구하기]
data = pd.read_csv(Path(__file__).with_name("pass_cross.csv"), encoding="euc-kr")
print(data.head())
# 결과 : 
#            공부함  공부안함   합격   불합격
#        0     1        0       1       0
#        1     1        0       1       0
#        2     0        1       0       1
#        3     0        1       0       1
#        4     1        0       1       0

print(data.shape)
# 결과 : (50, 4)
print()

# 귀무가설(H0) : 벼락치기 공부하는 것과 합격여부는 관계가 있다.
# 대립가설(H1) : 벼락치기 공부하는 것과 합격여부는 관계가 있다.

print(data[(data['공부함'] == 1) & (data['합격'] == 1)].shape[0])
# 결과 : 18
print(data[(data['공부함'] == 1) & (data['불합격'] == 1)].shape[0])
# 결과 : 7
print()

# 빈도표
print("빈도표 ---- ")
ctab = pd.crosstab(index=data['공부안함'], columns=data['불합격'], margins=True)
ctab.columns = ['합격', '불합격', '행합']
ctab.index = ['공부함', '공부안함', '열함']
print(ctab)
# 결과 : 
#                합격  불합격   행합
#       공부함    18       7     25
#       공부안함  12      13     25
#       열함      30      20     50
# = 관측값

# ** 자유도란? : 주어진 평균에 의해 각 원소들이 모두 값을 가지면 맨 마지막 값은 평균을 맞추기 위해 값을 마음대로 지정하지 못하는 것


# [ 2. 기댓값 구하기 ]
# 수식 :  기대돗수 = (각 행의 주변합) * (각 열의 주변합) / 총합(전체 표본수)


# [ 3. 카이제곱 분포 구하기]
# 수식 : χ² = Σ[(관측값 - 기댓값)² / 기댓값]
# 우리는 관측값을 구했고 기댓값도 알고 있다.
chi2 = (((18-15)**2 / 15) + ((7-10)**2 / 10) + ((12-15)**2 / 15) + ((13-10) ** 2 / 10))
print('검정통계량1 : ', chi2)
# 결과 : 3.0
# 그래프의 임의의 지점의 값이 3.0이다.
# 해당 3.0이 p-value 안에 있는지 밖에 있는지 알아야 한다.
# df = 2 - 1 = 1
# 유의수준 : 0.05

# "방법1". 전문가들이 미리 만들어둔 table을 보고 해당 값보다 크고 작음을 판별하기
# 임계값(Critical Value) : 귀무가설을 기각할 지 결정하는 경계값
# 카이제곱 표를 이용해서 임계값(경계값)을 구한다. : 3.84(at 카이제곱 분포표)
# 판정 : 즉 귀무채택역과 귀무기각역이 존재하는 그래프에서 그 사이를 3.84가 나누고 있다.
#        헌데 우리가 구한 카이제곱 값은 3.0으로 3.84보다 작다. 그래서
#        귀무 채택역에 카이제곱 값이 존재한다 = 귀무가설을 채택한다.

# "방법2". lib이용(p-value)
import scipy.stats as stats
observed = ctab.iloc[:2,:2] 
# 합계는 제외함

chi2, p, _, _ = stats.chi2_contingency(observed, correction=False)
# chi2가 검정통계량 값이다.
# 연속성 보정없이 계산한다

print('검정통계량2 : ', chi2)
# 결과 : 3.0

print('유의확률(p-value) : ', p)
# 결과 : 0.5578254003710748

# 판정 : 유의수준 0.05 < p
# p = 0.08326451666355042이므로 귀무가설을 채택한다
# 카이제곱 검정에 사용된 자료는 우연히 발생한 자료이다.

# 유의 수준 5%에서 유의한 연관성이 있다고 판단하기에는 증거가 충분하지 않다.

# 참고 : p-value가 0.05보다 크다고 해서 귀무가설이 옳다느 뜻이 아니다. 확정 아님
# 현재 데이터만으로 귀무가설을 기각할 만큼 충분한 통계적 근거가 없다는 뜻이다.

# 방법1과 방법2는 방법만 다르지 같은 값을 도출한다



# 1-2. 이원카이제곱 검정(가설채택방법2)














