# t-test의 종류 
# 1. 단일 표본 t검정
# 2. 독립 표본 t검정
# 3. 대응 표본 t검정

# <독립표본t검정(independent sample t-test)>
# 서로 독립인 두 집단의 평균 차이 검정
# 남녀의 성적, A반과 B반의 키, 겨익도와 충청도의 소득따위의 서로 독립인 두 집단에서 얻은 표본을 독립표본(two-sample)이라고 한다.

# 선행조건 : 두 집단이 정규분포를 따르고 "분산이 동일(등분산)하다"는 가정이 필요하다.

# 서로 다른 두 집단의 평균에 대한 통계검정에 사용된다.
# 비교를 위해 평균과 표준편차 통계량을 사용한다.
# 두 집단의 평균과 표준편차 비율에 대한 대조 검정법이다.

# ** 단일 표본 t검정 : 한 집단의 평균과 정해진 기준값 비교
#               ex) 학생들의 평균 점수가 70점과 다른가?
# ** 독립 표본 t검정 : 서로 독립적인 두 집단의 평균 비교
#               ex) A반과 B반의 평균 점수가 다른가?
# ** 대응 표본 t검정 : 같은 사람에게 반복 측정하거나 짝지은 두 측정값 비교
#               ex) 같은 학생들의 교육 전과 후의 점수가 다른가?

# = "한 집단을 기준값과 비교하는가, 두 집단 또는 두 측정값을 비교하는가?를 보고, 
#    두 개를 비교한다면 서로 독립적인지, 짝지어져 있는지를 확인해라"

# 이번 시간에는 서로 독립적인 두 집단의 평균을 비교한다.

# -------------------------------------------------------------------------------------------------------------------------------
# [1단계]. 대립가설과 귀무가설 설정 = "표본 데이터의 평균과 모집단의 평균(예상)은 차이가 있다(고정)/없다(고정)"
# [2단계]. 표본 데이터에서 '표본크기', '평균'과 '표준편차' 구하기
# [3단계]. 정규성 확인 : 표본 데이터와 모집단의 평균(예상)이 차이가 있는지 없는지 확인(3가지 방법)을 하기 위해 정규성을 확인해야함.
#                       - shapiro test
#                       - histplot
#                       - Quantitle-Quantitile plot(Q-Q plot)
#                         ** 정규성을 확인하는 이유 : 다음 과정에서 t검정을 할 때, 
#                                                    t검정의 p값을 믿고 해석할 수 있는 조건인지 
#                                                    확인하려고 정규성을 살펴보는 것이다.
# [4단계]. 그때 정규성을 만족(O) ... 표본수가 충분히 커서 분포확인이 수월  ->  t-test(모수검정) 
#               정규성을 만족(X) ... 표본수가 적어서 순위기반으로 검정함   ->  wilcoxon(비모수검정)
# [5단계]. 어느 가설을 기각하고 채택할 것인지 결정한다.
# ---------------------------------------------------------------------------------------------------------------------------------


# 실습1) 남녀 두 집단 간 파이썬 시험의 평균 차이 비교검정
# 남녀의 시험 평균이 우연히 같을 확률은 얼마일까?
# 만약 우연히 발생했다면 평균은 같을 것이고, 우연이 아니라면 평균은 다를 것이다.
# 95%의 신뢰구간에서 우연히 발생할 확률이 5%이상이면 귀무가설 채택이다.


# [1단계] : 가설설정
# 귀무가설 : 남녀 두 집단 간 파이썬 시험의 평균의 차이는 없다.
# 대립가설 : 남녀 두 집단 간 파이썬 시험의 평균의 차이는 있다.

# 독립변수(x) : 남녀 두 집단(범주형)
#               집단이 하나라면 one-sample t-test를 쓰고 집단이 2개라면 independent sample t-test를 사용한다.
# 종속변수(y) : 시험의 평균 점수(연속형)


# [2단계] : 두 집단, 각 집단의 평균 구하기
from scipy import stats
import pandas as pd
import numpy as np

male = [75, 85, 100, 72.5, 86.5]
female = [63.2, 76, 52, 100, 70]
print(np.mean(male), "\n" ,np.mean(female))
# 결과 
# male : 83.8 
# female : 72.24
# '두 개'의 집단에 대한 표본 자료이므로 "독립 표본 t검정"을 사용!!


# [3단계] : "정규성"과 "등분산성" 확인 = 선행조건 확인

# 선행조건1) 두 집단이 각각 정규 분포를 따라야 한다.
print("male집단의 정규성 : ", stats.shapiro(male))
print("female집단의 정규성 : ", stats.shapiro(female))
# 만약 표본 데이터 수가 많다면 정규성 검정을 하지 않아도 된다.
# 왜? ... 표본 수가 많으면 많을수록 중심극한정리에 의해서 하나의 값으로 수렴되기 때문
# 하지만 표본 데이터 수가 적으면 shapiro test를 사용해서 '정규성 검정'을 해야한다.
# 그때 각 표본 데이터들에 대하여 정규성을 만족하지 못하게 된다면 비모수 검정(Mann-whitney test)을 한다.
# ** 단일 표본 t검정에서는 정규성 만족하지 않을 때 비모수 검정(wilcoxon)을 사용했다.**

# 선행조건2) 두 집단의 분산이 같다는 가정이 필요하다 = 등분산성(데이터가 얼마나 넓게 혹은 좁게 퍼져있는지 정도) 
from scipy.stats import levene, bartlett
# levene : 정규성과 상관없이 사용가능하고 이상치에 민감하다. 하지만 어떤 분포도 사용이 가능하다.
# bartlett : 정규성이 있을 때만 사용하고 이상치에 덜 민감하다. 대신 정규분포일 때만 사용가능하다.
levene_stat, leven_p = levene(male, female)
print('p값 : ', leven_p)
# 결과 : p값(0.49565) > 유의수준(0.05)
# 해석 : 등분산성을 만족하므로 아래 명령을 사용한다.

# 등분산성 만족함(O) -> two_sample = stats.ttest_ind(male, female, equal_var=True)
# 등분산성 만족함(X) -> two_sample = stats.ttest_ind(male, female, equal_var=False) ... = Welch's t-test이다.


# [5단계] : 결과 확인
# 위에서 등분산성 만족이 떴으므로 equal_var=True를 사용한다.
two_sample = stats.ttest_ind(male, female, equal_var=True)

print(two_sample)
# 결과 : TtestResult(statistic=np.float64(1.233193127514512), pvalue=np.float64(0.2525076844853276), df=np.float64(8.0))
tv, pv = two_sample
print('t 검정 통계량 : ', tv)
# 결과 : 1.233193127514512
print('p값 : ', pv)
# 결과 : 0.2525076844853276

# 해석 : p값(0.2525) > 유의수준(0.05) 이므로 귀무가설 채택, 통계적으로 유의하지 않다.

