# = " 정규성을 만족하면 t-test(모수검정)를 쓰고 정규성을 만족하지 못하면 wilcoxon검정(비모수검정)을 써라"

# [1단계]. 대립가설과 귀무가설 설정 = "표본 데이터의 평균과 모집단의 평균(예상)은 차이가 있다(고정)/없다(고정)"
# [2단계]. 표본 데이터에서 '표본크기', '평균'과 '표준편차' 구하기
# [3단계]. 정규성 확인 : 표본 데이터와 모집단의 평균(예상)이 차이가 있는지 없는지 확인(3가지 방법)을 하기 위해 정규성을 확인해야함.
#                       - shapiro test
#                       - histplot
#                       - Quantitle-Quantitile plot(Q-Q plot)
#                         ** 정규성을 확인하는 이유 : 다음 과정에서 t검정을 할 때, 
#                                                    t검정의 p값을 믿고 해석할 수 있는 조건인지 
#                                                    확인하려고 정규성을 살펴보는 것이다.
# [4단계]. 그때 정규성을 만족(O) ... 표본수가 충분히 커서 분포확인이 수월  ->  t-test(모수검정) 
#         정규성을 만족(X) ... 표본수가 적어서 순위기반으로 검정함   ->  wilcoxon(비모수검정)
# [5단계]. 어느 가설을 기각하고 채택할 것인지 결정한다.

# -----------------------------------------------------------------------------------------------------------------------------

# 예시문제1
# [one-sample t 검정 : 문제1]  

# 영사기( 프로젝터 )에 사용되는 구형 백열전구의 수명은 250 시간이라고 알려졌다. 

# 한국 연구소에서 수명이 50 시간 더 긴 새로운 백열전구를 개발하였다고 발표하였다. = 300시간
# 연구소의 발표결과가 맞는지 새로 개발된 백열전구를 임의로 수집하여 수명 시간 관련 자료를 얻었다. 
# 한국 연구소의 발표가 맞는지 새로운 백열전구의 수명을 분석하라.

# 수집된 자료 :  305 280 296 313 287 240 259 266 318 280 325 295 315 278


# [0단계] : 문제정의
# 문제 : "새로 개발된 백열전구의 수명은 300시간인지 검정해보자"


# [1단계] : 가설 세우기
# 귀무가설 : 한국 연구소에서 개발한 백열전구의 '평균' 수명은 300시간이다.
# 대립가설 : 한국 연구소에서 개발한 백열전구의 '평균' 수명은 300시간이 아니다.


# [2단계] : 평균과 표준편차 구하기
import pandas as pd
import numpy as np
import scipy.stats as stats

data = [305, 280, 296, 313, 287, 240, 259, 266, 318, 280, 325, 295, 315, 278]
print("표본 '평균' 수명 : ", np.mean(data))
# 결과 : 289.7857

print("표본 크기 : ", len(data))
# 결과 : 14
# 표본의 갯수가 30개 이하이므로 정규성 확인을 한다!


# [3단계] : 정규성 확인
result = stats.shapiro(data)
print("shapiro result : ", result) # 3가지 중 shapiro test를 사용함
# 결과 : shapiro result :  ShapiroResult(statistic=np.float64(0.9661143911046914), pvalue=np.float64(0.8208613455706646))
#        p값(0.82085) > 유의수준(0.05)
# 해석 : p값이 더 크므로 정규성을 확보하고 있다.


# [4단계] : 정규성을 만족하니까 t-test이용
t_result = stats.ttest_1samp(data, popmean = 300)
print("t_result : ", t_result)
# 결과 : t_result :  TtestResult(statistic=np.float64(-1.556435658177089), pvalue=np.float64(0.143606254517609), df=np.int64(13))
#        p값(0.1436) > 유의수준(0.05) 


# [5단계] : 해석 : 귀무가설을 채택한다
# 즉, 한국 연구소에서 개발한 백열전구의 평균수명은 300시간이다.

# -----------------------------------------------------------------------------------------------------------------------------
# 예시문제2
# [one-sample t 검정 : 문제2]  
# 국내에서 생산된 대다수의 노트북 평균 사용 시간이 5.2 시간으로 파악되었다. 
# A회사에서 생산된 노트북 평균시간과 차이가 있는지를 검정하기 위해서 A회사 노트북 150대를 랜덤하게 선정하여 검정을 실시한다.  
# 실습 파일 : one_sample.csv
# 참고 : time에 공백을 제거할 땐 ***.time.replace("     ", ""),
#           null인 관찰값은 제거.

# [0단계] : 문제정의 
# 문제 : "국내 노트북 평균 사용시간인 5.2시간과 A회사에서 생산된 노트북 평균 사용 시간에 차이가 있는지 검정해보자"


# [1단계] : 가설 세우기 (A회사 중심)
# 귀무가설 : A회사 노트북 평균 사용시간은 5.2시간이다. (차이가 없다)
# 대립가설 : A회사 노트북 평균 사용시간은 5.2시간이 아니다. (차이가 있다.)


# [2단계] : 평균과 표준편차 구하기 
data2 = pd.read_csv("https://raw.githubusercontent.com/pykwon/python/refs/heads/master/testdata_utf8/one_sample.csv")
print(data2.head(3))

# [2.5단계] : 전처리를 해주어야 한다
print(data2.info())
data2['time'] = data2['time'].replace("    ", "").str.strip()
# 공백을 제거한다.

data2['time'] = pd.to_numeric(data2['time'], errors='coerce')
# str을 숫자로 바꿈

data2 = data2.dropna(subset=['time'])

print("표본 평균 사용시간 : ", data2['time'].mean())
# 결과 : 5.556880

print("표본 크기 : ", len(data2))
# 결과 : 109
# 30개의 결과가 넘기 때문에 굳이 정규성 확인을 할 필요가 없다.


# [3단계] : 정규성 확인
result2 = stats.shapiro(data2['time'])
print("time에 대한 shapiro result : ", result2) # 3가지 중 shapiro test를 사용함
# 결과 : time에 대한 shapiro result :  ShapiroResult(statistic=np.float64(0.9913731949455209), pvalue=np.float64(0.7242303346582368))
#       p값(0.72423) > 유의수준(0.05)
# 해석 : p값이 더 크므로 정규성을 확보하고 있다.
# 그러니 t-test로 넘어가라.
# 만약 정규성을 확보하지 않는다면 비모수 검정방법인 wilcoxon을 사용해라


# [4단계] : 정규성을 만족하니까 t-test이용
t_result2 = stats.ttest_1samp(data2['time'], popmean=5.2)
print("t_result2 : ", t_result2)
# 결과 : t_result2 :  TtestResult(statistic=np.float64(3.9460595666462424), pvalue=np.float64(0.00014166691390197136), df=np.int64(108))
#        p값(0.0001) < 유의수준(0.05) 


# [5단계] : 해석 : 대립가설을 채택한다
# 즉, A회사 노트북 평균 사용시간은 5.2시간이 아니다!


# -----------------------------------------------------------------------------------------------------------------------------
# 예시문제3
# [one-sample t 검정 : 문제3]  

# https://www.price.go.kr/tprice/portal/main/main.do 에서 
# 메뉴 중,  가격동향 -> 개인서비스요금 -> 조회유형:지역별, 품목:미용 자료(엑셀)를 파일로 받아 미용 요금을 얻도록 하자. 
# 정부에서는 전국 평균 미용 요금이 15000원이라고 발표하였다. 이 발표가 맞는지 검정하시오. (월별)

# [0단계] : 문제정의 
# 문제 : "정부에서는 전국 평균 미용 요금이 15000원이라고 발표하였다."


# [1단계] : 가설 세우기 
# 귀무가설 : 전국 평균 미용 요금은 15000원이다.(발표가 맞다)
# 대립가설 : 전국 평균 미용 요금은 15000원이 아니다.(발표가 틀리다)
# pip install xlrd

# [2단계] : 평균과 표준편차 구하기 
data3 = pd.read_excel("개인서비스지역별_동향[2026-09월]1026-5시35분.xls")
print(data3.head(3))

# [2.5단계] : 전처리를 해주어야 한다
data4 = data3.iloc[0, 2:]
# 지역 데이터만 추출
data4 = pd.to_numeric(data4, errors='coerce')
data4 = data4.dropna()
# 결측값 제거

print("표본 평균 미용 요금 : ", data4.mean())
# 결과 : 202322
print("표본 크기 : ", len(data4))
# 결과 : 16
# 30개의 결과가 넘지 않기 때문에 굳이 정규성 확인을 한다.


# [3단계] : 정규성 확인
result3 = stats.shapiro(data4)
print("data4에 대한 shapiro result : ", result3) # 3가지 중 shapiro test를 사용함
# 결과 : ShapiroResult(statistic=0.942035115554694, pvalue=0.3746942909463131)
#       p값(0.37469) > 유의수준(0.05)
# 해석 : 정규성을 기각할 통계적 근거가 부족하다.
# 그러니 t-test로 넘어가라.
# 만약 정규성을 확보하지 않는다면 비모수 검정방법인 wilcoxon을 사용해라


# [4단계] : 정규성을 만족하니까 t-test이용
t_result3 = stats.ttest_1samp(data4, popmean=15000)
print(t_result3)
# 결과 : TtestResult(statistic=np.float64(7.496645276690416), pvalue=np.float64(1.8990407726371975e-06), df=np.int64(15))
#        p값(1.89904) > 유의수준(0.05) 

# [5단계] : 해석 : 귀무가설을 유지한다
# 즉, 전국 평균 미용 요금은 15000원이 아니다.(발표가 틀리다)