# 분산분석 (ANalysis Of Variance)
# : 3개 이상의 모집단에 대한 가설검정
# : 분산이 발생한 과정을 분석하여 요인에 의한 분산과 요인을 통해 나누어진 각 집단 내의 분산으로 나누고 요인에 의한 분산이 의미 있는 크기를 가지는지를 검정하는 것을 의미한다.
# 3개 집단 이상의 평균비교에서는 독립인 두 집단의 평균 비교를 반복하여 실시할 경우에 제 1종오류가 증가하게 되어 문제가 발생한다. = t검정을 여러번 하는 것
# 이를 해결하기 위해 Fisher가 개발한 분산분석을 이용하게 된다.
# 분산이 발생한 과정을 분석하여 요인에 의한 분산과 요인을 통해 나눠진 각 집단 내의 분산으로 나누고, 요인에 의한 분산이 의미있는 크기를 가지는지를 검정한다.

# 요인 내에 그룹이 몇개인지를 알아야 한다. 

# f값 = 집단간분석 / 집단내분산

# 카이제곱과 유사한 그래프에서 임계값을 기준으로 f값이 기각역에 있냐 채택역에 있냐의 차이로 가설을 검정한다

# 집단 간 분산(Between Variance)이 커진다 = f값이 커지면 p값이 작아진다 = 대립가설을 채택한다.
# 그룹 내 분산은 모여있어야 좋고 그룹 간 분산은 퍼져 있어야 좋다.

# 종류 
# 1. 일원분산분석(ONE-WAY ANOVA) : 종속변수(영향변수)를 집단으로 나눠 가능한 많은 분산을 설명하는 것이 목적이다.
#                                 3개 이상의 독립적인 각 집단의 평균이 통계적으로 의미가 있는 정도로 
#                                 차이가 있는지를 결정하는데 사용된다. 
#                                 이 때 귀무가설은 '모든 개별 집단의 평균값과 같다'가 된다.

# 2. 이원분산분석(TWO-WAY ANOVA)

# 3. 사후분석(사후검정)

# -------------------------------------------------------------------------------------------------------------------------------------------------------------------
# 서로 독립인 3개의 집단의 평균 차이를 검정

# 실습) 3가지 교육방법을 적용하여 1개월 동안 교육받은 교육생 80명을 대상으로 실기시험을 실시. 
# three_sample.csv

# [1단계] : 가설 설정
# 독립변수(범주형) : 요인(교육방법)은 하나이다 - 교육방법의 종류가 3가지이다. = 그룹이 3개이다 = t-test를 사용하지 않는다.
# 종속변수(연속형) : 실기시험의 평균점수

# 귀무가설(영 가설)  : 3가지 교육방법에 따른 실기시험의 평균점수의 차이가 없다.
# 대립가설(연구가설) : 3가지 교육방법에 따른 실기시험의 평균점수의 차이가 있다.

# [2단계] : 평균 구하기(+ 이상치 구하기)
import pandas as pd
import scipy.stats as stats
from statsmodels.formula.api import ols
# 추정 및 검정, 회귀, 시계열 분석 등의 기능을 제공한다.
# ols(Ordinary Least Squares - 최소 제곱법 회귀를 이용하여 a와b값을 얻어낸다.)

data = pd.read_csv("https://raw.githubusercontent.com/pykwon/python/refs/heads/master/testdata_utf8/three_sample.csv")
# 외부 데이터 불러오기
print(data.head(3), ' ', len(data))
print(data.describe())
# 결과 : 
#             no     method     survey       score
# count  80.0000  80.000000  80.000000   80.000000
# mean   40.5000   1.962500   0.650000   78.212500
# std    23.2379   0.802587   0.479979   64.886404
# min     1.0000   1.000000   0.000000   33.000000
# 25%    20.7500   1.000000   0.000000   58.000000
# 50%    40.5000   2.000000   1.000000   65.000000
# 75%    60.2500   3.000000   1.000000   79.500000
# max    80.0000   3.000000   1.000000  500.000000

# 이상치(outlier) 확인
# 방법1. 시각화
import matplotlib.pyplot as plt
plt.boxplot(data.score)
# 사분위수를 이용하여 이상치를 그래프로 확인한다. 지금 그래프를 보면 일부값이 이상치로 존재한다.
plt.show()
# 방법2. 수치화
# 이 이상치를 수치(값)로 표현하고 싶다.
# IQR로 구한다
q1 = data['score'].quantile(0.25)
q3 = data['score'].quantile(0.75)
iqr = q3 - q1

# 이상치 기준
lower = q1 - 1.5 * iqr
upper = q3 + 1.5 * iqr
print(f"Q1:{q1}, Q3:{q3}, IQR:{iqr}")
print("이상치 하한 값: ", lower)
print("이상치 상한 값: ", upper)
# 결과 : 
# Q1(0.25) : 58.0,   Q3(0.75) : 79.5,   IQR : 21.5
# 이상치 하한 값:  25.75
# 이상치 상한 값:  111.75
# 상한과 하한 바깥의 값이 "이상치"이다.
outlier = data[(data['score'] < lower) | (data['score'] > upper)]
print('outlier : ', outlier)
print('outlier의 갯수 : ', len(outlier))
# outlier :          no    method  survey   score
#            7번      8       2       1      500
#           59번     60       1       0      438
# outlier의 갯수 : 2개
# ----------------------------------------------------------------------------------------

data = data.query("score <= 100")
# 시험점수이므로 100점 이내의 값만 작업에 참여
print(len(data))
print(data.describe())
# 결과 : 
#               no     method     survey       score
# count  78.000000  78.000000  78.000000   78.000000
# mean   40.666667   1.974359   0.653846   68.192308
# std    23.137459   0.805410   0.478822   15.043709
# min     1.000000   1.000000   0.000000   33.000000
# 25%    21.250000   1.000000   0.000000   58.000000
# 50%    40.500000   2.000000   1.000000   65.000000
# 75%    60.500000   3.000000   1.000000   78.000000
# max    80.000000   3.000000   1.000000  100.000000

# 교육 방법별 만족 건수 - 교차표(crosstab) 사용
ctab = pd.crosstab(data['method'], data['survey'])
ctab.index = ['교육방법1', '교육방법2', '교육방법3']
ctab.columns = ['만족', '불만족']
print(ctab)
#            만족  불만족
# 교육방법1    9      17
# 교육방법2   10      18
# 교육방법3    8      16
# ------------------------------------------------

# [3단계] : anova를 위한 lin_model불러오기
print("ANOVA검정")

import statsmodels.api as sm
# anova를 위해서는 f값이 필요하다.
# 그래서 f값을 얻기 위해 회귀분석 모델을 사용한다!

# 중요(수식코드)...회귀분석모델을 불러와!!
lin_model = ols("data['score'] ~ data['method']", data=data).fit() 
# = 회귀분석 모델 객체를 생성

result = sm.stats.anova_lm(lin_model, typ=1)
# anova_lm이라는 라이브러리는 회귀분석모델을 필요로 하기 때문에 우리가 직접
# 회귀분석모델을 만들어주었다.
pd.set_option('display.max_columns', None)
print(result)
# 결과 : 
#                      df(자유도)    sum_sq(제곱합)    mean_sq(제곱평균)        F값        PR(>F)(p값)
#    data['method']          1.0         27.980888       27.980888(MSR)    0.122228          0.727597
#    Residual(잔차)         76.0      17398.134497       228.922822(MSE)        NaN               NaN

# [4단계] : t값과 f값을 통한 가설 검증
# DataFrame해석 -> 
# 제곱평균에서 27.980888(MSR) / 228.922822(MSE) 를 해주면 F값인 0.122228이 나온다.
# F검정통계량 : 0.122228
# p-value    : 0. 0.727597
# 해석 : p-value(0. 0.727597) > alpha(0.05)이므로 귀무가설을 채택한다.
#       즉, 3가지 교육방법에 따른 실기시험 평균 점수에 차이가 없다!!

f_value = result.loc["data['method']", "F"]
p_value = result.loc["data['method']", "PR(>F)"]
print("f_value : ", f_value)
# 결과 : f_value :  0.1222284760031028

print("p_value : ", p_value)
# 결과 : p_value :  0.7275969113136878

# 교육방법별 평균 점수 ... 이제 평균구하기...ㄷㄷㄷ
print("\n 교육방법별 평균 점수 : , \n")
print(data.groupby('method')['score'].mean())
# 결과 : 
#   method
#     1      67.384615
#     2      68.357143
#     3      68.875000

# 하지만 anova는 평균의 차이가 없다라고 뭉뚱그려서 말한다.
# 우리는 상세하게 그 차이의 값을 알 수 없다.
# ANOVA는 각 '교육방법'은 1:! 평균비교는 알려주지 않는다.
# ...그래서 등장한 것이 '사후분석'이다. 사후 분석을 사용하면 어느 그룹과의 평균값이 의미가 있는지 없는지를 알 수 있따.
from statsmodels.stats.multicomp import pairwise_tukeyhsd
tukResult = pairwise_tukeyhsd(endog = data['score'], groups=data['method'])
print(tukResult)
# ====================================================
# group1 group2 meandiff p-adj   lower   upper  reject
# ----------------------------------------------------
#      1      2   0.9725 0.9702 -8.9458 10.8909  False
#      1      3   1.4904 0.9363 -8.8183  11.799  False
#      2      3   0.5179 0.9918 -9.6125 10.6483  False
# ----------------------------------------------------

# tukeyhsd 시각화
import matplotlib.pyplot as plt
tukResult.plot_simultaneous(xlabel='mean', ylabel='group')
plt.show()
# Turkey HSD : 원래 반복 수가 동일하다는 가정하에 고안된 방법
# 집단 간 평균 차이를 정밀하게 확인 가능
# 각 집단의 표본 수의 차이가 크면 결과의 신뢰가 떨어짐.
# 그래서 집단 내 표본의 분산(차이)은 좁게, 집단 간 표본의 분산(차이)은 크게 잡아야 한다.